[
    {
        "id": "1kntvfi",
        "title": "The SP will hit 7000 by year’s end",
        "author": "InjuryEmbarrassed532",
        "created_utc": 1747375948.0,
        "selftext": "I am bullish on the rest of the year, tariffs are a nothing burger that will have no effect on the US tech driven stock market. \nNo one knows what will happen, but in my opinions value and cash bros are about to learn a lesson on par with what they should have already learned starting back in 2010. \n\nSome of the reasons why I think we will reach new highs.\n\n1. De-Dollarization Backfires and U.S. Markets Become the Last Safe Haven\nAs countries diversify away from the U.S. dollar, capital might not flow into gold or emerging markets as expected—but instead flood into U.S. equities, especially large-cap tech. In this view, the U.S. remains the most liquid, transparent, and innovation-driven market. Ironically, global distrust of U.S. fiscal policy could boost stocks as foreign capital chases yield and safety in equities, not Treasuries.\n\n\n2. The AI Productivity Supercycle Is Real (and Underestimated)\nThe market may be on the cusp of a productivity revolution akin to the internet boom—or even greater. The belief is that AI, led by companies like NVIDIA, Microsoft, and Meta, will drive exponential gains in corporate earnings and efficiency. If the market begins to price in several years of accelerated earnings growth now, a melt-up to 7000 becomes plausible, especially with retail and institutional money piling in.\n\n\n3. The U.S. Embraces “Soft MMT” (Modern Monetary Theory)\nWhile outright MMT remains taboo, policymakers may continue to blur the line between fiscal and monetary stimulus—effectively funding government programs via asset markets and Fed balance sheet expansion. A “soft MMT” regime could keep equities buoyant through aggressive infrastructure, AI, or social investment bills funded by yield curve control or disguised QE.\n",
        "score": 0,
        "comments": 11
    },
    {
        "id": "1kns174",
        "title": "Currently deciding what to do with my cash: HYSA vs SGOV?",
        "author": "futurespacecadet",
        "created_utc": 1747368979.0,
        "selftext": "Right now my HYSA has an annual percentage yield of 3.60%, but after a google search it says SGOV annual yield is currently 4.79%? What the hell?\n\nWhy even have an HYSA at all if this is yielding more? Should I put everything in there?\n\nAlso, how does it work? You just buy SGOV with your brokerage like a regular stock and you start yielding dividends? thanks!",
        "score": 4,
        "comments": 3
    },
    {
        "id": "1knqkt4",
        "title": "Need some help/guidance.",
        "author": "CompetitionBoth3684",
        "created_utc": 1747364192.0,
        "selftext": "I was hoping for some financial guidance that will put me on the fastest path possible to long term wealth. \n\nA little background. I am 29 years old and turn 30 in 2 months. I am a cop in California and make what I would describe as a “good” income, but not great (about 60k net a year). I drive an older car that runs GREAT and I am very frugal. I am NOT a homeowner but would like to buy my first house by late spring/early summer 2026. I’ve been dating a great girl for about a year and she would like to move in with me and pay me rent when I buy said first house. I currently reside with my parents (typical gen z/younger millennial situation due to this outrageous economy/crazy unaffordable world we’re living in). \n\nMy parents gifted me 10,000 at the age of 17. I have now 12 years later turned that into 190,000 and have that currently parked in a HYSA where I make about 620 dollars of intrest a month. This HYSA will be about 200,000 by mid-august and will only go up from there. I know NOTHING about stocks and/or how to invest my money. Any guidance and/or advice would be greatly appreciated. ",
        "score": 1,
        "comments": 15
    },
    {
        "id": "1knoz01",
        "title": "High yield savings accounts?",
        "author": "Arch_Rebel",
        "created_utc": 1747359046.0,
        "selftext": "Not really about stocks but I figured it wouldnt hurt to ask here anyway. I’ve got a chunk of cash sitting in a shitty USAA savings account earning like .38% interest. Where can I put it that is safe, will allow me to access it if needed, and will still make me some money? I was thinking about a high yield savings account. Any other suggestions?",
        "score": 8,
        "comments": 40
    },
    {
        "id": "1knm7sy",
        "title": "Short Foot Locker Now?",
        "author": "BlueAgain5175",
        "created_utc": 1747350658.0,
        "selftext": "Foot Locker shares jumped huge today after the Dicks aquisition news. Only a small amount is left between the current price and the future acquisition price per share. Could this be a reverse arbitrage play if I do my research and believe that the deal will fall through? What is the downside since the Foot Locker stock is unlikely to rise much more? ",
        "score": 0,
        "comments": 21
    },
    {
        "id": "1knl8ab",
        "title": "Google hits 150 million users for subscription service with help of AI",
        "author": "joe4942",
        "created_utc": 1747347889.0,
        "selftext": "https://www.reuters.com/business/google-hits-150-million-users-subscription-service-with-help-ai-2025-05-15/\n\n> SAN FRANCISCO, May 15 (Reuters) - Alphabet's Google One subscription service, which charges consumers for cloud storage and artificial intelligence features, recently crossed 150 million subscribers, the company told Reuters.\n\n> That represents a 50% increase since February 2024, when Google One crossed 100 million subscriptions nearly six years after the service launched.\n\n> The same month, Google introduced a $19.99 a month plan with access to AI capabilities unavailable for free users. The company continues to offer Google One subscription tiers for file storage, but without most AI features, at lower prices.\n\n> The new AI tier accounted for \"millions\" of subscriptions, according to Shimrit Ben-Yair, a vice president at Google in charge of the subscription service.\n\n> Google One is part of Alphabet's effort to diversify beyond advertising, which accounted for more than three-quarters of its $350 billion in overall 2024 revenue.\n\n> Alphabet's success with subscriptions could play a key role in its long-term financial outlook as it grapples with the threat of AI chatbots, like OpenAI's ChatGPT or Google's own Gemini, to its search engine stronghold.",
        "score": 148,
        "comments": 48
    },
    {
        "id": "1knj7rb",
        "title": "Michael Burry has sold every stock in his portfolio except for a new position in Estee Lauder, $EL.",
        "author": "IssaReallyGoodDay",
        "created_utc": 1747342714.0,
        "selftext": "Big news from the Big Short legend himself! According to the latest 13F filings, Michael Burry has sold off every single stock in his portfolio except for a brand-new position in Estee Lauder ($EL).\n\nHe’s been wrong multiple times since calling the 2008 short, but this is definitely interesting.",
        "score": 562,
        "comments": 124
    },
    {
        "id": "1knhyrt",
        "title": "The real problem of the U.S is that if MAG7 is removed, the US stock market will be a flat horizontal line.",
        "author": "duck4355555",
        "created_utc": 1747339647.0,
        "selftext": "\nFrom a professional perspective, this problem has actually seriously affected all aspects of the United States. It can be said that the United States is in a limited-scale 2000 Nasdaq crisis. But this is not a bad thing, but a good thing. It sounds counterintuitive, but if MAG7 shrinks and one of them, such as Tesla, goes bankrupt, then the United States will tighten or introduce a bill that is more stringent than the 404 Act. Restrict disorderly capital. Let more money enter normal industries. This is what MAGA can do.",
        "score": 0,
        "comments": 48
    },
    {
        "id": "1knho1m",
        "title": "$BULL (Webull) dropped from $19 to $12 — Is this support level or just a pause before more downside?",
        "author": "Fedor_L",
        "created_utc": 1747338900.0,
        "selftext": "Hello traders and investors,\n\nI’ve been following $BULL for a while. A week ago, it looked like it had strong upside potential — especially after it ran up to around $19. But since then, it’s been a steady decline, and now it’s hovering just above $12, which seems to be a key support level based on previous price action. (That's just my opinion)\n\nI haven’t seen much recent discussion about it here, so I’m curious:\n\nIs anyone still bullish on $BULL at these levels?\n\nDo you see any catalysts that could reverse this downtrend?\n\nOr is this support likely to break?\n\nWill be great to see informed opinions and maybe some technical or fundamental takes I haven't considered.\n\nThere is not much financial info about Webull, or I just can't find it..\n\nAppreciate your insights!",
        "score": 0,
        "comments": 25
    },
    {
        "id": "1knfye8",
        "title": "Storm Ahead? Powell Warns Supply Shocks May Lock In Higher Rates for Years",
        "author": "ZestSweet",
        "created_utc": 1747334694.0,
        "selftext": "Federal Reserve Chair Jerome Powell has signaled a significant shift in the central bank’s monetary policy framework, acknowledging that the current strategy, established in 2020, may no longer be adequate in addressing the evolving economic landscape marked by persistent supply shocks and heightened inflation volatility. ￼\n\nKey Takeaways:\n\n\t* Reassessment of Monetary Policy Framework: Powell announced that the Fed is reevaluating its approach to monetary policy, particularly the average inflation targeting strategy adopted in 2020. This strategy allowed for inflation to exceed the 2% target temporarily to compensate for previous shortfalls. However, the unforeseen surge in inflation post-pandemic has rendered this approach less effective.  ￼\n\n\t* Emergence of Persistent Supply Shocks: The economy is facing more frequent and potentially enduring supply shocks, such as those stemming from tariffs, pandemics, and severe weather events. These shocks pose a dual challenge by simultaneously driving up prices and hindering economic growth, complicating the Fed’s policy decisions.  ￼\n\n\t* Shift Towards Inflation Control: In light of these challenges, Powell indicated a strategic pivot back to prioritizing inflation control. The Fed aims to develop a policy framework that is robust across various economic conditions, ensuring preparedness for potential downturns while maintaining its commitment to a 2% inflation target.  ￼\n\n\t* Implications for Interest Rates: While Powell did not provide specific guidance on immediate interest rate adjustments, the acknowledgment of higher real interest rates and the potential for more volatile inflation suggests that the Fed may maintain elevated rates for an extended period to anchor inflation expectations.\n\nThe Fed plans to unveil the revised policy framework between August and September 2025, aiming to enhance its resilience to unforeseen economic developments while upholding its dual mandate of price stability and maximum employment.  ￼",
        "score": 364,
        "comments": 115
    },
    {
        "id": "1knd5wb",
        "title": "Turning Water into Wealth - $LB Landbridge Analysis",
        "author": "thelastsubject123",
        "created_utc": 1747327980.0,
        "selftext": "In the past, turning water into wine was considered a biblical miracle. However, with the rise of AI, anyone can now do this incredible feat by investing in Landbridge.\n\nLandbridge is a company that owns land, focusing on the Delaware sub-basin within the Permian Basin. For those unaware, this region is known for having the most active oil and natural gas exploration in the US. If this sounds familiar, its business model and area of activity is similar to the highly successful Teas Pacific ($TPL). However, a massive difference between TPL and LB is LB primarily relies on water royalties for their revenues.\n\nLet's break down their most recent 1Q25 Earnings: [https://s204.q4cdn.com/780627658/files/doc\\_presentation/2025/LandBridge-Q1-25-Earnings-Deck\\_vF.pdf](https://s204.q4cdn.com/780627658/files/doc_presentation/2025/LandBridge-Q1-25-Earnings-Deck_vF.pdf)\n\nRevenue came in at $44M, up 131% YoY. 59% came from royalties of land usage. 33% Came from royalties of sales of water/products obtained from land. Only 8% came from royalties from actual Oil & Gas Production. The bulk of these revenues are due to the water needs of high power data centers. As companies continue to develop $10B+ data centers, the access of water is what enables the usage of these centers, creating a continuous revenue opportunity for LB.\n\nThe key takeaway is Landbridge does not take on any production/capex risk- it is simply a landowner that allows other companies to operate their production on their assets. This makes it an extremely high margin business, making Visa/Nvidia look inefficient.\n\nThe company boasts \"adjusted EBITDA\" margins of 88%. That being said, current GAAP net margins are at 35%, a far cry from the expected 90% management alludes to. This is due to SBC and Interest Expense  due to debt issued to fuel land acquisition. In addition, quarterly FCF is down 40% YoY from $27M to $16M. This is due to a temporary increase in accounts receivable that will be normalized as revenue is recognized.\n\nI personally believe that this is palatable for the moment. There is only so much prime attractive land and I would rather LB acquire it now to generate incredible cash flow in the future. For example, the most recent purchase of Bone Ranch for $245M. This led to a 70% QoQ increase in water royalty volumes and will bring in a MINIMUM of $25M per year for the next 5 years. Again, this is all revenue with essentially 90% margins. These are accretive purchases that will payoff tenfold in the coming years.\n\nAs Landbridge continues to engage in accretive M&A to accelerate high margin revenue, the thesis continues to strengthen alongside the growth of water intensive data centers.",
        "score": 2,
        "comments": 5
    },
    {
        "id": "1kncgdn",
        "title": "US GDP projections since dec 2024",
        "author": "You_Will_Fail1",
        "created_utc": 1747326260.0,
        "selftext": "Below are the forecasts made for US economy in dec 2024, march 2025 and may 2025.\n\nBefore 2025 there was positive outlook for GDP growth, inflation to come down and even rates to come down. No we have much slower GDP growth, increased inflation and maybe 1 rate cut. The only thing that is better now that it was before 2025 is the value of S&P500.\n\n||\n||\n|Date|18.12.24|19.03.25|15.05.25|\n|GDP growth|2.10 %|1.70 %|1.30 %|\n|PCE inflation|2.50 %|2.70 %|3.10 %|\n|SPY|582.5|565.4|590|",
        "score": 6,
        "comments": 1
    },
    {
        "id": "1kn9q3z",
        "title": "Your best dividend stocks 2025?",
        "author": "whatever-bee27",
        "created_utc": 1747319598.0,
        "selftext": "I have some money in my account just sitting that I would rather at least be working for me.\n\nWhat are your top dividend stocks? \n\nI've researched the popular ones that come up in a Google search, but curious/getting a feel for what other ones are out there that people like. Not picky about industry. \n\nEdit: Thank you everybody! I'll be looking through all the suggestions - I've got some homework to do now :)",
        "score": 52,
        "comments": 137
    },
    {
        "id": "1kn93dc",
        "title": "UNH has reached a bottom at $250",
        "author": "Smartmoney243",
        "created_utc": 1747318003.0,
        "selftext": "I am nearly certain this is the bottom on a much over done dip on United Healthcare (UNH). They have an incredible new CEO, and just a “probe” into criminal investigations, they don’t even know if anything was wrong they’re just probing. Even then an investigation could take years and nothing will come of it for a long time. \n\nThis stock is down PAST COVID LOWS. WOW, we will never see it this cheap again. The market is irrational on this, come on the next ER the CEO will set things straight. This is MAX pain and anyone buying here will be greatly rewarded. I have zero doubts. Trust me this is the bottom. Even do a remind me in 1 year, you’ll see how right I was. This is a load the boat moment!",
        "score": 0,
        "comments": 88
    },
    {
        "id": "1kn7vz6",
        "title": "BREAKING: Walmart to hike prices imminently",
        "author": "ActuallyMy",
        "created_utc": 1747314795.0,
        "selftext": "Earnings Call On prices\n\n\"We will likely see price hikes toward the end of this month and then certainly much more in June,\" per Chief Financial Officer John David Rainey\n\n\n\"We will do our best to keep our prices as low as possible but given the magnitude of the tariffs, even at the reduced levels announced this week, we aren't able to absorb all the pressure given the reality of narrow retail margins,\" \n\nCEO Doug McMillon\n\nAre we cooked? Personally, this market doesn't make sense to me. Originally, I thought it was quite over sold, especially parts of the market, but now I feel like it's gone the other direction. I guess we will see.",
        "score": 8452,
        "comments": 941
    },
    {
        "id": "1kn7ozh",
        "title": "Coinbase says hackers bribed staff to steal customer data and are demanding $20 million ransom",
        "author": "WickedSensitiveCrew",
        "created_utc": 1747314266.0,
        "selftext": "> Coinbase on Thursday reported that cyber criminals bribed overseas support agents to steal customer data to use in social engineering attacks. The incident may cost Coinbase up to $400 million to fix, the company estimated. The crypto exchange operator received an email on May 11 from someone claiming they obtained information about certain Coinbase customer accounts as well as other internal Coinbase documentation, including materials relating to customer-service and account-management systems, Coinbase reported in an SEC filing. Although passwords and private keys were not compromised, affected data included sensitive data such as names, addresses, phone numbers and emails; masked bank account numbers and identifiers as well as the last four digits of social security numbers; government ID images and account balances, the company said.\n\n> “Cyber criminals bribed and recruited a group of rogue overseas support agents to steal Coinbase customer data to facilitate social engineering attacks,” the company said in a blog post. “These insiders abused their access to customer support systems to steal the account data for a small subset of customers. No passwords, private keys, or funds were exposed and Coinbase Prime accounts are untouched. We will reimburse customers who were tricked into sending funds to the attacker.” Coinbase had detected the breach independently in previous months, per the filing. It immediately terminated the employees involved, warned customers whose information may have been accessed and enhanced its fraud monitoring protections.\n\n> The threat actor paid overseas contractors and employees in support rolls to obtain the information, it said. “We’re cooperating closely with law enforcement to pursue the harshest penalties possible and will not pay the $20 million ransom demand we received,” the company said in the blog. “Instead we are establishing a $20 million reward fund for information leading to the arrest and conviction of the criminals responsible for this attack.” Coinbase operates the largest crypto exchange in the U.S. In that past week it announced an acquisition that is expected to help it expand its global reach and gained entry to the benchmark S&P 500 stock index, which will take effect next week.\n\nhttps://www.cnbc.com/2025/05/15/coinbase-says-hackers-bribed-staff-to-steal-customer-data-and-are-demanding-20-million-ransom.html",
        "score": 401,
        "comments": 50
    },
    {
        "id": "1kn7o0m",
        "title": "(05/15) Interesting Stocks Today - DOJ investigating UNH!",
        "author": "WinningWatchlist",
        "created_utc": 1747314194.0,
        "selftext": "This is a daily watchlist for short-term trading: I might trade all/none of the stocks listed, and even stocks not listed! I am targeting potentially good candidates for short-term trading; I have no opinion on them as investments. The potential of the stock moving today is what makes it interesting, everything else is secondary.\n\nNews: [Trump Wants Apple To Stop Moving Iphone Production To India](https://www.bloomberg.com/news/articles/2025-05-15/trump-wants-apple-to-stop-moving-iphone-production-to-india)\n\n[**UNH (UnitedHealth)**](https://finviz.com/quote.ashx?t=UNH&p=d) \\- The U.S. Department of Justice is conducting a criminal investigation into UnitedHealth Group for \"potential Medicare fraud\" related to its Medicare Advantage business. The probe, active since at least last summer, is looking into \"questionable diagnoses\" to inflate payments from Medicare. UNH dropped close to 40 points yesterday afterhours. Not sure if it'll continue but short biased unless we make some insane move downward even more. The spike premarket was attributed to them denying the news. This news is particularly bad because DOJ confirmed investigation is criminal. Other stocks such as HUM/CVS/CI have moved on this as well.\n\n[**ETOR (eToro)**](https://finviz.com/quote.ashx?t=ETOR&p=d) \\- eToro's IPO priced at \\~$68 per share, above the expected range of $46–$50, and the stock bounced off \\~$65 off some strong bids. Mainly interested to see if the strong bids at $65 still exist (unlikely but I'll just keep an eye out anyway). Mainly a sector play in C-brokerages and the C-Market, since most of their income is derived from it. Beyond what I highlighted in the IPO analysis post, not interested in this long term. Probably will just trade as a proxy to the C-market in the future and I don't like the structure of their contract for diffs.\n\n[**BABA (Alibaba)**](https://finviz.com/quote.ashx?t=BABA&p=d) \\- Alibaba reported Q4 revenue of 236.45B yuan, a 7% increase year-over-year, but slightly below analyst expectations of 237.91B yuan. Income from operations nearly doubled to 28.47B yuan driven by improved efficiency and reduced share-based compensation. This has been on a decent run since April 8th (peak fear tariff selloffs). Watching $125 level. Alibaba's cloud division saw an 18% revenue increase, with AI-related product sales posting triple-digit growth.\n\n[**FL (Foot Locker)**](https://finviz.com/quote.ashx?t=FL&p=d) \\- Dick’s Sporting Goods (DKS) confirmed a $2.4B acquisition of Foot Locker at $24 per share, nearly double Foot Locker's previous closing price. Currently long and interested in seeing if we can converge even closer to $24, but overall don't see any other trade in this except for a reversal of news. Mainly integration challenges and potential antitrust concerns are the big risk, but unlikely with current admin.\n\n[**TSLA (Tesla)**](https://finviz.com/quote.ashx?t=TSLA&p=d) \\- Tesla's stock has risen from $275 to $350 over the past six days but failed to break the $350 level twice. Currently short pretty close to $350, but will bail if we break $350 (probably a lower price level like $345). TSLA has mainly been on a tear (attributed to Musk stepping away from DOGE and returning to TSLA), and the news of Tesla board exploring a new pay deal for the CEO dropped yesterday. Mainly a short play based on how parabolic the stock has been, but will bail as needed.",
        "score": 17,
        "comments": 10
    },
    {
        "id": "1kn749a",
        "title": "No way Musk gets $50B. In my Aussie MBA, the US’s 300:1 pay ratio is taught as the most extreme example of inequality and company governance",
        "author": "duck4355555",
        "created_utc": 1747312624.0,
        "selftext": "One reason is the CEO PAY RATIO, and the other reason is corporate governance. Tesla's management is mostly Musk's cronies, and it has lost its public nature. I had a serious discussion with many Tesla fans on Twitter Space in 2023. They think I am a stupid European old continent style professional manager. What public nature, what small and medium shareholders' interests. The great Musk leads Tesla to one milestone after another, which is a victory. Selling so many Tesla cars is a victory, and launching rockets again and again is a victory, why not pay salaries. A person with only a few hundred shares actually sued a key figure who made the United States great, and it was approved. This is a joke.\n\nI mentioned the CEO PAY RATIO and the responsibility and morality of enterprises to society, which attracted more Tesla fans, including typical investors on Reddit who think that there is no European old continent in the United States, including the stupid morality of the old world like Australia, which is a joke. In the United States, only whoever makes money is the most powerful. No need to reason, just show the holdings, full of social Darwinism theory, if you believe in Tesla, buy CALL, if you don't believe, buy PUT, why discuss science, why discuss technology and implementation routes, no need, these are all jokes. And there is no scientific spirit, just shout orders.\n\nBut in fact, when I think back to 2017, when I was attending an MBA course at a very small school in Australia, the teacher talked about the concept of CEO Pay Ratio, saying that American companies are as high as 300:1. That is, the gap between grassroots employees and CEOs is 300 times. And the UK, a bad country in Europe, is only 70-100 times. I knew that this salary would not satisfy Musk. Because if Musk's salary is really approved, it will bring the US Pay Ratio to an incredible level. The United States has completely lost any morality.\n\nAlthough the United States is indeed a country where everything is about money and whoever has money is the king, I also see that the strong Delaware judges are trying to maintain the final decency of the judiciary to give social fairness.\n\nCompared to the SEC, which weakly sued Musk and was even broken by Musk, the Delaware judge is the last and best shield of the United States.\n\nThe SEC is a regulatory unit that lacks even the most basic dignity and is far weaker than China's Securities Regulatory Commission.",
        "score": 479,
        "comments": 175
    },
    {
        "id": "1kn72yt",
        "title": "PPI for final demand decreases 0.5% in April; services decline 0.7%, goods unchanged",
        "author": "tnguyen5057",
        "created_utc": 1747312518.0,
        "selftext": "The Producer Price Index for final demand fell 0.5 percent in April. Prices for final demand services decreased 0.7 percent, while the index for final demand goods was unchanged. On an unadjusted basis, the index for final demand rose 2.4 percent for the 12 months ended in April.\n\nhttps://www.bls.gov/ppi/",
        "score": 226,
        "comments": 82
    },
    {
        "id": "1kn6dhd",
        "title": "Dick’s Sporting Goods to buy Foot Locker for $2.4 billion",
        "author": "_hiddenscout",
        "created_utc": 1747310394.0,
        "selftext": "Dick’s Sporting Goods has agreed to buy smaller rival Foot Lockerfor $2.4 billion, the second major footwear deal this month after the buyout of Skechers, as U.S. retailers look to navigate a tough demand landscape.\n\nThe sporting goods retailer has offered $24 per share of Foot Locker, the companies said on Thursday, representing an 86% premium to the stock’s last close.\n\nShares of Foot Locker surged 82% to $23.45 in premarket trading, after losing about 40% in the year so far. Dick’s Sporting Goods fell 8%.\n\nThe acquisition, Dick’s largest deal in the sporting goods industry, will help the company boost its presence in malls and expand to international markets for the first time, positioning the retailer to better tackle a slowdown in consumer spending.\n\nSeveral U.S. retailers have issued gloomy forecasts in recent weeks as the Trump administration’s hefty tariffs have forced Americans to tighten spending in anticipation of potentially higher prices on everything from household staples to toys and apparel.\n\nOver the last few years, Foot Locker has lost market share to competition from brands such as Nike and Under Armour, which have expanded their direct-to-consumer business, as well as falling customer visits to indoor malls, where most Foot Locker stores are located.\n\nIt operates 2,400 retail stores across 20 countries in markets including North America, Europe and Asia, and logged worldwide sales of $8 billion last year.\n\nhttps://www.cnbc.com/2025/05/15/dicks-sporting-goods-to-buy-foot-locker.html\n",
        "score": 99,
        "comments": 34
    },
    {
        "id": "1kn6as3",
        "title": "Walmart CFO says price hikes from tariffs could start later this month, as retailer beats on earnings",
        "author": "WickedSensitiveCrew",
        "created_utc": 1747310149.0,
        "selftext": "https://www.cnbc.com/2025/05/15/walmart-wmt-q1-2026-earnings.html\n\n\n> Walmart on Thursday fell just short of quarterly sales estimates, as even the world’s largest retailer said it would feel the pinch of higher tariffs.  Even so, the Arkansas-based discounter stuck by its full-year forecast, which calls for sales to grow 3% to 4% and adjusted earnings of $2.50 to $2.60 per share for the fiscal year. That cautious profit outlook had disappointed Wall Street in February. Walmart also marked a milestone: It posted its first profitable quarter for its e-commerce business both in the U.S. and globally. The business has benefitted from the growth of higher-margin moneymakers, including online advertising and Walmart’s third-party marketplace.  In an interview with CNBC, Chief Financial Officer John David Rainey said tariffs are “still too high” – even with the recently announced agreement to lower duties on imports from China to 30% for 90 days. \n\n> “We’re wired for everyday low prices, but the magnitude of these increases is more than any retailer can absorb,” he said. “It’s more than any supplier can absorb. And so I’m concerned that consumer is going to start seeing higher prices. You’ll begin to see that, likely towards the tail end of this month, and then certainly much more in June.” Walmart said it expects net sales to increase 3.5% to 4.5% for the fiscal second quarter, but declined to provide guidance for earning per share or operating income growth because of fluctuating U.S. tariff policy.\n\n> Here is what the big-box retailer reported for the three-month period that ended May 2 compared with Wall Street’s estimates, according to a survey of analysts by LSEG:\n\n- Earnings per share: 61 cents, adjusted vs. 58 cents expected\n\n- Revenue: $165.61 billion vs. $165.84 billion expected\n\n> In the fiscal first quarter, Walmart’s net income fell to $4.49 billion, or 56 cents per share, compared with $5.10 billion, or 63 cents per share, in the year-ago quarter. Revenue rose about 2.5% from $161.51 billion in the year-ago period, but had a 1% headwind from lapping Leap Day in the year-ago period. Yet it marked Walmart’s first quarterly revenue miss since February 2020. Comparable sales – an industry metric also known as same-store sales – jumped 4.5% for Walmart U.S. and 6.7% for Sam’s Club, excluding fuel. E-commerce sales increased 21% in the U.S., marking the 12th straight quarter of double-digit gains. Global e-commerce sales jumped 22% year over year.\n\n> Walmart is often seen as a barometer for the health of the U.S. consumer because of its thousands of stores and large customer base that cuts across age, income and region. Rainey told CNBC that Walmart has not seen a noticeable shift in consumer behavior from previous quarters. “They’re discerning. They’re mindful. They’re maybe a little concerned about possible looming price increases, but their behaviors largely have not changed. They’re still looking for value,” he said. Still, he said, Walmart plans to “play offense” by keeping its price gaps below competitors. He said the company will absorb some of the higher prices from tariffs and expects suppliers will, too.\n\n> Unlike some of its peers, Walmart has advantages that have helped it better weather an uncertain economy and woo a more selective U.S. consumer. As the nation’s largest grocer, it sells food and necessities that drive steadier store and website traffic. And as a well-known value player, it can use lower prices to attract even middle- and upper-income customers who want to pay less. Already, Walmart has attracted wealthier shoppers with faster deliveries, store remodels and a wider assortment of brands.",
        "score": 232,
        "comments": 37
    },
    {
        "id": "1kn5hfh",
        "title": "United health care stock ruined my life",
        "author": "Smartmoney243",
        "created_utc": 1747307324.0,
        "selftext": "I bought the dip early on UNH stock on margin and now I’m on the edge of a margin call. This stock is cheaper than I could’ve possibly imagined and I believe buying at these levels is nearly zero risk. The worst is priced in. \n\nI am going to borrow more money anyway I can. This is officially the bottom. It will not go under $250 EVER. I will trick my aging parents into lending me at least $100k to buy this dip, max out credit cards, the typical stuff…. Buying the dip and digging in deeper is the ONLY WAY to salvation. Should I double down as much as I can till I have nothing left? ARE WE NEAR THE BOTTOM ON UNH? I might rope if this goes wrong ",
        "score": 0,
        "comments": 41
    },
    {
        "id": "1kn507n",
        "title": "After shares of Reddit jumped more than 11% on Wednesday, CNBC’s Jim Cramer explained why he’s enthusiastic about the company’s future.",
        "author": "FreeCelery8496",
        "created_utc": 1747305523.0,
        "selftext": "He recommended investors buy Reddit, but only if they have substantial risk tolerance.\n\n“While I think Reddit’s absolutely worth buying at these levels, even after today’s monster move, stocks like these are only worth owning if you can stomach some serious volatility like we’re having right now,” he said. “Keep in mind, we’re always one presidential tweet — or whatever you want to call it — away from these kinds of names falling out of favor all over again.”\n\nDespite the day’s gains, Cramer surmised that there’s still a buying opportunity because the stock is down substantially from its February highs.\n\nAlthough the platform’s stock didn’t start to climb after it posted earnings at the beginning of May, Cramer found the results impressive. Reddit comfortably beat Wall Street’s expectations for earnings and revenue.",
        "score": 21,
        "comments": 53
    },
    {
        "id": "1kn4utg",
        "title": "Who wins the robotaxi race - WAYMO or Tesla?",
        "author": "AnimeInvesting",
        "created_utc": 1747304946.0,
        "selftext": "BIG QUESTION ready for discussion - as there is so much momentum behind TESLA and Musk' statements around the Robotaxi and FSD.\n\nWaymo seems to be far ahead of Tesla and has 1.500 cars on the streets in 4 big US cities, while Musk talks about 10-20 cars to be placed in June/July in Austin.\n\nWaymo now reached 250k rides per week, a steep incline from 150k in Oct 2024 and 50k in May 2024.\n\n[https://www.forbes.com/sites/alanohnsman/2025/05/05/inside-the-waymo-factory-building-a-robotaxi-future/](https://www.forbes.com/sites/alanohnsman/2025/05/05/inside-the-waymo-factory-building-a-robotaxi-future/)\n\n“In fact, these vehicles can pick up their first public passengers less than 30 minutes after leaving the factory,” Waymo said in its blog post. The company said that vehicles intended for other cities can be deployed into public service in a matter of hours after being shipped to their local depot.\n\nBesides, questions remains on \"camera only\"-concept of Tesla competing with camera/LIDAR/radar of others. Others deem camera only concept to be unsafe in conditions like rain and fog. Telsa is rumoured to have hit a dead end road with this concept.\n\nJohn Krafcik, former Waymo CEO, clapped back, telling Business Insider, \"Tesla has never competed with Waymo — they've never sold a robotaxi ride to a public rider, but they've sold a lot of cars.\" His email continued, \"And although Tesla hopes to compete with Waymo someday, they've failed utterly and completely at this for each of the 10 years they've been talking about it.\"\n\nWhat do you think?\n\n",
        "score": 107,
        "comments": 271
    },
    {
        "id": "1kn3z2q",
        "title": "r/Stocks Daily Discussion & Options Trading Thursday - May 15, 2025",
        "author": "AutoModerator",
        "created_utc": 1747301433.0,
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on stock options, but if options aren't your thing then just ignore the theme.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nRequired info to start understanding options:\n\n* [Call option Investopedia video](https://www.investopedia.com/terms/c/calloption.asp) basically a call option allows you to buy 100 shares of a stock at a certain price (strike price), but without the obligation to buy\n* [Put option Investopedia video](https://www.investopedia.com/terms/p/putoption.asp) a put option allows you to sell 100 shares of a stock at a certain price (strike price), but without the obligation to sell\n* Writing options switches the obligation to you and you'll be forced to buy someone else's shares (writing puts) or sell your shares (writing calls)\n\nSee the following word cloud and click through for the wiki:\n\n[Call option - Put option - Exercising an option - Strike price - ITM - OTM - ATM - Long options - Short options - Combo - Debit - Credit or Premium - Covered call - Naked - Debit call spread - Credit call spread - Strangle - Iron condor - Vertical debit spreads - Iron Fly](https://www.reddit.com/r/stocks/wiki/options-themed-post)\n\nIf you have a basic question, for example \"what is delta,\" then google \"investopedia delta\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&restrict_sr=on&sort=new&t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&restrict_sr=on&include_over_18=on&sort=new&t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&restrict_sr=on&include_over_18=on&sort=new&t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&restrict_sr=on&include_over_18=on&sort=new&t=all) Friday.",
        "score": 15,
        "comments": 603
    },
    {
        "id": "1kn1g08",
        "title": "Purely rational: Tesla robotaxi without L4 isn’t even a Challenger — Magic Quadrant shows how far it is from Waymo’s leadership",
        "author": "duck4355555",
        "created_utc": 1747290628.0,
        "selftext": "\n\n||\n||\n|**Leaders**|WAYMO|\n|**Challengers**|Cruise|\n|**Visionaries**|Zoox,AutoX|\n|**Niche Players**|Tesla Robotaxi，Pony.ai|\n\n\n\nIn our business analysis, there is a method called Gartner Magic Quadrants. If a normal analyst puts Tesla's CyberCAB product in this analysis method, he will only have one position, that is, NichePlayers, and even this is overestimating Tesla. After all, Waymo officially has L4 level autonomous driving, while Tesla's FSD is only L2 (in case you haven't heard, Tesla's FSD is only L2, not even L3).\n\n\n\nWaymo is obviously in the leader quadrant. It has launched fully autonomous Robotaxis in Phoenix and San Francisco. It has been successfully running for six years since 2019, although there have been many funny accidents during this period. But Waymo at least dares to claim that it has L4, not L3, or L3 plus, or like FSD, which is obviously L2 but induces the driver to let go. (By the way, L2 allows the driver to take both hands off the steering wheel, and only the United States can do this in the world).\n\nSo Tesla doesn't even have L4 autonomous driving, so what can it use to compete with Waymo, which dares to apply for L4 and uses lidar technology that is ridiculed by Tesla fans. L2 means that the responsibility is put on the driver, but L4 requires Waymo to pay for every accident with real money.\n\nAs of 15/May/2025 (sorry, we are used to typing dates like this in Australia). Tesla has not submitted an application for L4 autonomous driving, so I would like to ask Tesla fans. What will they use to make Cybercab on June 19? Of course, Musk's good friend, a gentleman in the White House, may be able to slam the table and roar angrily, demanding that NHTSA officials unconditionally let his best political allies and election campaigners start Robotaxi business immediately.\n\n\n\nFrom my perspective, the US stock market really feels like the Nasdaq bubble in 2000. It is full of lies and incompetence at the regulatory level. The entire market is either VR, AR or AI, quantum chips (here again, quantum algorithms do not solve the problem of general computing. Before 2022, there were many research projects in the United States to study how to accelerate quantum computing for general computing, and they all failed), autonomous driving, and cryptocurrency. Remove MAG7, where is the value of the United States?\n\nIn my opinion, Europe is better than the United States. The European academic community does not brag about AI, but focuses on researching colliders.\n\nI once asked a friend from NASA, \"Why don't you launch more deep space satellites to explore the universe?\" Their answer was \"Space science is not like Silicon Valley, where you can just blow bubbles. Space research requires a lot of objective conditions, and these objective conditions are calculated based on decades or even hundreds of years, such as planets connecting in a straight line. This kind of opportunity requires a long wait, and before the astronomical conditions are met, there is very little that humans can do).\n\nI will write about the current AI scams when I have time, which is also a purely rational analysis.\n\nFinally, I want to thank the administrators here. I have been banned in several forums for telling the truth.",
        "score": 38,
        "comments": 10
    },
    {
        "id": "1kn14fw",
        "title": "Take on Take two interactive shares",
        "author": "rikzer09",
        "created_utc": 1747289357.0,
        "selftext": "So as everyone knows that GTA6 is around the corner and Rockstar Games will keep teasing it until its release next year, so Planning to purchase Take two interactive shares (it's my first stock I will buy) yes people will say it won't rack up but with its huge anticipation & the game will be a masterpiece in itself (which I can guarantee as me being a gamer half of my life) which can surely make the company a more dominant one in its industry.  And apart from that putting money onto a good index funds which can yield some dividend as well. So what do experts here have to say on that huge release and how it will change or affect the market.....TIA",
        "score": 13,
        "comments": 29
    },
    {
        "id": "1kn1087",
        "title": "Goldman Sach not reporting trades",
        "author": "Mouse1701",
        "created_utc": 1747288886.0,
        "selftext": "Reuters NEW YORK, May 14 (Reuters) - Goldman Sachs (GS.N), opens new tab will pay a $1.45 million civil fine to settle a U.S. regulator's claims that the Wall Street bank failed to accurately report data for billions of stock market trades.\n\nThe Financial Industry Regulatory Authority said in a consent order on Tuesday that coding errors at Goldman led to inaccurate reporting of 36.6 billion trades to the CAT Central Repository, which helps the regulator monitor markets.\n\nCAT is an acronym for consolidated audit trail.\nFINRA also said a technology failure caused Goldman in October and November 2021 to inaccurately prepare 90.8 million order memoranda, report 6.9 million trades and issue more than 372,000 trade confirmations. \n\nIt said the failure also led Goldman to report 98,322 trades it should not have reported.\nThe settlement also addresses alleged supervisory failures.",
        "score": 58,
        "comments": 14
    },
    {
        "id": "1kmzqgq",
        "title": "Does investing really make you wealthy?",
        "author": "-TheRandomizer-",
        "created_utc": 1747284103.0,
        "selftext": "Was just thinking about this today, the general rule of thumb is to invest in the S&P 500 passively, to return on average 7% a year. This is great and all, but, if everyone does this, no one gets rich off it. If myself and everyone else in a country invests, no one gets ahead. This seems more like a defensive measure than a wealth building tool. Thoughts?",
        "score": 0,
        "comments": 34
    },
    {
        "id": "1kmyh7c",
        "title": "CoreWeave reports more than 400% growth in its first earnings",
        "author": "StocksTok",
        "created_utc": 1747279798.0,
        "selftext": "Artificial intelligence infrastructure provider CoreWeave reported better-than-expected revenue on Wednesday in the company’s first earnings release since going public. The company reported revenue of $981.6 million, compared to expectations of $853 million, and -$1.49 EPS.\n\nRevenue soared 420% in the quarter, which ended on March 31, from $188.7 million a year ago, according to a statement. That compares with 737% growth for all of 2024. The company’s net loss of $314.6 million widened from $129.2 million a year earlier, partly because of $177 million in stock-based compensation costs for awards tied to the initial public offering.\n\nCoreWeave sees $4.9 billion to $5.1 billion in 2025 revenue, which implies a growth rate of 363%. That growth requires hefty capital expenditures. The company expects capex of $20 billion to $23 billion for the year. The range includes impact from OpenAI and other factors. Analysts surveyed by LSEG had anticipated $4.61 billion in full-year revenue.\n\n[CNBC Article](https://www.cnbc.com/2025/05/14/coreweave-crwv-q1-2025-earnings-report.html)",
        "score": 32,
        "comments": 6
    },
    {
        "id": "1kmyehf",
        "title": "Boeing's record-breaking deal: Qatar Airways to buy up to 210 planes",
        "author": "StocksTok",
        "created_utc": 1747279540.0,
        "selftext": "Boeing and Qatar Airways on Wednesday announced a deal for the Middle Eastern airline to buy up to 210 jets, notching the U.S. planemaker’s largest-ever order of widebody aircraft. The order — the biggest in Qatar Airways’ history — includes 130 of Boeing’s 787 Dreamliners and 30 of its much-delayed 777-9s, with options for up to 50 more planes, the companies said in a press release.\n\nQatar Airways also signed an agreement with GE Aerospace for more than 400 engines to power the Boeing planes, those companies said in another joint release. The purchase of widebody aircraft engines is the largest in GE Aerospace’s history, according to the release.\n\nBoeing CEO Kelly Ortberg appeared alongside Trump at the Amiri Diwan in Doha for the signing ceremony. “This is a critical next step for Qatar Airways on our path as we invest in the cleanest, youngest and most efficient fleet in global aviation,” Qatar Airways CEO Badr Mohammed Al-Meer said in a statement. “This is so we can meet the strong demand in the airline as we seamlessly connect passengers to the world better than anyone.”\n\nBoeing Commercial Airplanes CEO Stephanie Pope said the “record-breaking order” with Qatar Airways “solidifies their future fleet with our market-leading widebody airplane family at its center.”\n\n[CNBC Article](https://www.cnbc.com/2025/05/14/boeing-qatar-trump-plane-deal.html)",
        "score": 490,
        "comments": 154
    },
    {
        "id": "1kmxgbf",
        "title": "Regarding the UNH criminal probe, look at the WellCare fraud for clues of the Armageddon scenario.",
        "author": "puukkeriro",
        "created_utc": 1747276511.0,
        "selftext": "Back in 2007, criminal charges were bought against WellCare and its executives for defrauding Florida's Medicaid program. \n\nhttps://www.justice.gov/archives/opa/pr/four-former-wellcare-executives-found-guilty-florida\n\nIt's stock ticker is WCG, and you can find a historical chart here:\n\nhttps://www.barchart.com/stocks/quotes/WCG/interactive-chart\n\nIn October 23, 2007, the Justice Department announced charges against the company and the stock dropped from $115 to $20 over a few days, a loss of 82%. It eventually stabilized in the $30 range before going back down into the single digits during the Great Recession. However, it recovered back to its previous price levels by 2017 and reached $350 in 2021 before being acquired. \n\nSo... if the worst happens to UNH (e.g., criminal probe where charges are filed and the government brings the hammer against the company and wins), expect this to go way below $200 and stay there for a long time.\n\nBut of course, such prosecution of corporate fraud is quite rare so take that as you will. I think UNH will ride this one out as it's too big to fail.",
        "score": 87,
        "comments": 34
    },
    {
        "id": "1kmwtpi",
        "title": "Safety of Index Funds",
        "author": "Agile-Technology-209",
        "created_utc": 1747274560.0,
        "selftext": "What do we think is the future for index funds like VTI? Am currently 24, looking at a 40 year timespan. Is it really that easy to just put in 300+ a month into VTI, and it’ll grow a large amount in the future? New to investing, just started this year. If it’s so easy to just invest in index funds, why doesn’t everyone do it? Currently it trades at around 285, how much should we expect in 40 years? 2000+?",
        "score": 1,
        "comments": 26
    },
    {
        "id": "1kmw8bi",
        "title": "Borrowing HELOC to invest?",
        "author": "TheCuriousBread",
        "created_utc": 1747272752.0,
        "selftext": "With the home paid off and the HELOC just collecting dust. I'm thinking of deploying some risk capital into the game.\n\nNow as someone who's 30. I find myself conflicted.\n\nI COULD invest in high growth stocks which would probably return 10%+ over the next 30 years. However I will be eating the interest cost for 30 years cos they don't pay shit.\n\nI COULD invest in dividend stocks which will yield 4-5% over the next 30 years meanwhile probably growing like ....nothing at all, 1,2% pa but on the flip side I don't pay the interest. The dividend accounts for it. Since I'm losing most of my div to interest cost, I can't DRIP and since the stocks are only growing 1-2% pa, realistically I'm only getting 2-4% extra meanwhile risking everything including the house.",
        "score": 0,
        "comments": 20
    },
    {
        "id": "1kmvgj4",
        "title": "In my opinion, 06/19, CyberCab is released, and the world will know that Tesla is the second Enron",
        "author": "duck4355555",
        "created_utc": 1747270364.0,
        "selftext": "I am a long-term Chinese investor. I have been firmly bearish on Tesla for four years and have been laughed at by other investors for four years. But I am firm in my opinion because I am different from other investors. I have two undergraduate degrees in IT and economics, and I am also a mechanical enthusiast in my spare time. I understand mechanics, economics and IT better than others. I believe that the release date of Cybercab will be another Enron and Tesla's doomsday. How can it be achieved unless his good friend, the president, helps.\n\nAll the achievements of BEV today are based on government subsidies. In 2024, after the European government cancelled the BEV subsidies, the sales of hybrid and Toyota immediately increased. So when countries around the world gradually canceled the subsidies for electric vehicles in the next few years, who will buy them? Of course, the president's friends can ask the federal government to buy them at the government level.\n\nToday, Tesla's market value is higher than Toyota, GM and Honda. This is really a joke.\n\nMany people also told me that \"Tesla is not just a car company, it is the future, Mars, artificial intelligence, and innate intelligence. It will replace all humans.\"\n\nI don't want to discuss this topic with people who have no science and engineering background anymore. Really, there is a saying in China that \"if you don't cheat a fool's money, it's a waste.\" These people are the same.\n\nSometimes I really feel strange about the US stock market. The SEC is like a thing that bullies the weak and clings to the powerful. On the contrary, even the China Banking Regulatory Commission, which is called the \"fraud market\", has always been a heavy-handed strike in regulating companies. It's just that it must cooperate with the Chinese government to control stock prices and the stock market, but it has never been afraid of any company. And the SEC is too weak.",
        "score": 140,
        "comments": 179
    },
    {
        "id": "1kmua7t",
        "title": "UNH feels like the new TSLA",
        "author": "Draymond_Punch",
        "created_utc": 1747266812.0,
        "selftext": "Ruined public image plus one bad news after another. And being oversold as a result. I wish I had jumpped on TSLA when it went down to the low 200s. And now I'm wondering if I'm making the same mistake not trying to catch the falling knife that is UNH.",
        "score": 0,
        "comments": 42
    },
    {
        "id": "1kmtb1q",
        "title": "UnitedHealthcare Under Criminal Investigation",
        "author": "BernoulliCat",
        "created_utc": 1747264026.0,
        "selftext": "According to a recent WSJ exclusive, the Justice Department is investigating UnitedHealth Group for possible criminal Medicare fraud.\n\nWhile the exact nature of the potential criminal allegations against UnitedHealth is unclear, the people said the federal investigation is focusing on the company’s Medicare Advantage business practices.\n\nThe bad news just keeps on piling.. puts at market open wouldn’t be a bad idea, ha.",
        "score": 1375,
        "comments": 165
    },
    {
        "id": "1kmrfnb",
        "title": "Why would anybody buy 0,5% 10 year T-bonds in 2022 when inflation was 8% over TIPS",
        "author": "revaz125125",
        "created_utc": 1747258973.0,
        "selftext": "As the title says, I've been trying to figure out this topic with chatgpt over the past hour and a half and it keeps repeating itself but either I'm dumb or chatgpt doesn't understand what I'm asking.\n\nI've been going over the SVB case, and couldn't wrap my head around as to why would they commit such big funds in 0,5% T-bonds over TIPS, or simply commit at all at such low yields (+had they hedged against the risks the upside would pretty much be offset and the investment would maybe breakeven). I understand that they are risk free and offer liquidity and all that, but why not just go with Tips, at this point with such high inflation (around 8% in 2022) maybe I'm wrong or missing something (probably the other) but isn't it a pretty much a guarantee that over the next 10 years, the average inflation would be over 0,5% and that would make the second more attractive? Somebody please help me understand this.\n\nEdit: I understand that the real yield aka coupon payment on tips is much lower, but still the principal gain is much higher",
        "score": 44,
        "comments": 42
    },
    {
        "id": "1kmpdjt",
        "title": "So nvidia is now 3.3T and the most valuable company on the market?",
        "author": "Relative_Drop3216",
        "created_utc": 1747253920.0,
        "selftext": "Many people say this company is not overvalued, can we really value this company as the most valuable or are we getting ahead of ourselves?\n\nSeems risky buying nvidia at AH with the context of everything going on. ",
        "score": 394,
        "comments": 191
    },
    {
        "id": "1kmoexe",
        "title": "Short Interest viewable on Schwab or ToS?",
        "author": "giovannigiannis",
        "created_utc": 1747251587.0,
        "selftext": "I am learning about short interest, which, as I understand, is a measure of how many people are betting that a stock will go down. \n\nIs there a metric on the Schwab app (or ThinkOrSwim app) that will show you this metric?\n\nI use ToS app, and they have a lot of useful tabs showing a bunch of different metrics, most of which I do not understand.  But S I am coming to understand this short interest concept, I’d like to keep an eye on it.  I just don’t know where to go to find this information.  I know there are methods for calculating it, but that alone tells me that there must be a service somewhere that tabulates it automatically. Anyone know where I can find it?  As I said, I hope ToS or Schwab app have it. ",
        "score": 4,
        "comments": 2
    },
    {
        "id": "1kmn37m",
        "title": "The emotional chaos of selling a stock that’s ripping - Advice on taking profits",
        "author": "10baggerss",
        "created_utc": 1747248396.0,
        "selftext": "I don’t think enough people talk about how hard it is to sell when you’re actually up big on a position.\n\nEveryone’s always focused on the entry. What’s the next 5x? What are you buying? But honestly, I’ve found the real challenge is knowing what to do once something you own starts ripping.\n\nI’ve had this happen a few times now. I’d get in early on something, maybe just messing around with a small position, and then suddenly it’s up 200%, 300%, sometimes more. And I’d love to say I calmly trimmed, locked in profit, and moved on. But that’s not how it went.\n\nUsually you start getting emotional. You feel smart. You tell yourself it’s going higher. You start thinking about what your gain could be if you just held a little longer. Sometimes you even add more. I’ve done that. Then it pulls back 40%, and now you’re stuck. Selling feels wrong. Holding feels worse. You just sit there watching it bleed.\n\nOne thing that’s helped me is trying to think of selling the same way I think about buying. When a position gets big and my portfolio value starts growing fast, I’ll stop and ask: “If I didn’t own this stock right now, would I be comfortable putting this amount of money into it at this current price and chart?”\n\nMost of the time, the answer is no. That’s when I know I probably need to trim. I don’t want one name becoming way too outsized just because I’m emotionally tied to it. Rebalancing feels more like a risk management decision than some emotional call to dump the stock. And honestly, it helps a lot.\n\nAnother thing is selling in chunks. I might trim a bit after a double. More if it keeps going. That way I’m locking something in but still giving it room to run. I try not to beat myself up if it goes higher after I sell. That’s just part of the game.\n\nI’ve still made plenty of mistakes. I’ve round-tripped some great trades because I got greedy or froze. But I’m starting to learn that having some kind of exit mindset early on makes everything easier. Even just writing down a rough plan or price target helps take the edge off when it comes time to decide.\n\nAnyway, just sharing my experience. If you’ve ever held too long, sold too early, or felt stuck on what to do when you’re up big, you’re definitely not the only one. Curious how other people think about this stuff too.",
        "score": 71,
        "comments": 84
    },
    {
        "id": "1kmks0z",
        "title": "Tesla Institutional Investor Movement- Mixed Bag- Mostly Positive",
        "author": "iD-10T_usererror",
        "created_utc": 1747242937.0,
        "selftext": "I said I would post when the latest release of institutional holdings on Tesla to come out to see if the \"smart money\" had any change in sentiment. The answer seems to be: Not really. If anything, there are some large institutional investors showing continued bullish trends, with a few even becoming wildly bullish and making huge moves, clearly expecting lots of upside. And I am a Tesla bear holding a battered short position but trying to remain at least a little objective on this matter. If this is what the \"smart money\" is doing, it doesn't look good for the bears.\n\nFrom the previous round of reports posted on the Nasdaq website, overall institutional ownership increased 1.11% from 47.37% to 48.48%. Additionally, the total number of institutional holders increased 1.75%, from 4020 to 4091. Just looking at the 3/31/25 filing date, there were 138 firms that opened new positions and 362 that completely closed their positions. Most firms that were both opening new positions and closing positions were relatively small in terms of total shares bought/sold with the exception of Nuveen, which opened a huge new position (listed below).\n\nI don't have access to the raw data but here are some notable moves from the 3/31/25 (submitted/visible 45-days after) reporting date of the larger firms that have substantial holdings of Tesla that are at least in the billions.\n\n**Buyers (shares/% increase in overall position):**\n\n|Institution|Shares Added|Percent Increase in Position|\n|:-|:-|:-|\n|Vanguard|3,694,524|1.519%|\n|Blackrock|3,482,055|1.722%|\n|Geode Capital Management|2,487,085|4.076%|\n|JPM\\*|3,426,144|9.52%|\n|Goldman Sachs|14,670,839|123.081%|\n|Charles Schwab|849,091|4.901%|\n|Invesco|2,211,300|17.585%|\n|Nuveen|12,531,327|new|\n|Citigroup|3,611,937|47.184%|\n|Deutsche Bank|1,733,531|20.778%|\n|Assenagon Asset Management|2,978,026|54.277%|\n|Sumitomo Mitsui Trust Group|456,356|5.793%|\n|Swiss National Bank|26,100|0.321%|\n|Hsbc Holdings|19,426|0.242%|\n|National Bank Of Canada\\*|5,566,098|307.721%|\n|Franklin Resources|860|0.013%|\n|National Pension Service|172,845|3.345%|\n|Mitsubishi Ufj Asset Management|578,266|12.34%|\n|Rhumbline Advisers|20,295|0.39%|\n|Dimensional Fund Advisors|119,500|2.577%|\n|Wells Fargo|1,176,846|35.262%|\n|Aberdeen Group|1,729,053|65.228%|\n\n*\\*JPM analyst has one of the lowest price targets on Tesla and Canada was supposed to be \"mad\" at America. Ha! Not so much obviously...*\n\n**Sellers (shares/% decrease in overall position):**\n\n|Institution|Shares Sold|Percent Decrease In Position|\n|:-|:-|:-|\n|Capital World Investors|(954,950)|\\-2.317%|\n|Fmr LLC|(4,448,041)|\\-12.883%|\n|Northern Trust Corp|(992,003)|\\-3.471%|\n|Bank Of New York Mellon|(418,764)|\\-2.46%|\n|Wellington Management Group|(1,285,882)|\\-12.639%|\n|Jennison Associates|(994,502)|\\-10.239%|\n|Capital Research Global Investors|(755,524)|\\-9.637%|\n|Primecap Management|(473,525)|\\-6.267%|\n|American Century Companies|(157,691)|\\-2.183%|\n|Bank Of Montreal|(50,142)|\\-0.729%|\n|Ubs Group Ag|(757,244)|\\-10.429%|\n|California Public Employees Retirement System\\*|(60,314)|\\-1.265%|\n|Principal Financial Group Inc|(165,095)|\\-4.362%|\n|New York State Common Retirement Fund\\*|(112,326)|\\-3.195%|\n|Ark Investment Management|(28,594)|\\-0.87%|\n\n*\\*I assume these sales are politically motivated to some extent.*\n\nAgain, trying to be objective here, it clearly looks like moves to the upside are being made by more prominent name firms and in more dramatic fashion. There are two firms with over a billion in holdings that added triple digit percent increases and Nuveen, that made a massive move to rush in. Of course, I could go down the huge list of transactions and cherry pick things to paint the picture either way. Are there firms with hundreds of millions in holdings cutting their position by \\~50%? Yes. But there are actually more making the opposite/optimistic move (as the overall numbers at the beginning of this post indicate).\n\nMy takeaway: The big boys are making huge moves on Tesla. There is a lot of institutional activity in general, with astonishing sums of money being injected into the stock by big name firms. Net flows in are larger than net flows out. Don't shoot the messenger- But the indicator is bullish. And the recent stock trend reflects it.",
        "score": 18,
        "comments": 18
    },
    {
        "id": "1kmjx3u",
        "title": "Google needs 'big bang breakup' that would value its businesses at $3.7 trillion as AI threatens Search",
        "author": "ironcladjogging",
        "created_utc": 1747240902.0,
        "selftext": "Goog is one of my largest positions. I'm bullish on the company and thinking about going all in.\n\nThe stock has been punished for fears it seems to be:\n\n1. Out of the AI race (it's not, Gemini is fantastic)\n2. Search is dead (it's not but it probably will be given enough time. However, it could easily be like tobacco companies that have great margins and exist for decades as solid businesses without growth due to personal habits)\n3. Will be broken up\n\nThis last point is fascinating to me because as I understand it, if it were to be broken up, shareholders would receive shares in all of the constituent parts. \n\nMeaning, I would get a shares in GCP, YouTube, Search, Waymo, etc. I would LOVE to have shares in any of those businesses individually. \n\nThe article below values all of Google's businesses at a staggering $3.7 trillion.\n\n[https://finance.yahoo.com/news/google-needs-big-bang-breakup-that-would-value-its-businesses-at-37-trillion-as-ai-threatens-search-analyst-171143842.html?guce\\_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce\\_referrer\\_sig=AQAAADxZpheK3u8TveRxgpzmaZCVXvQ7wAOPpW-pIlY8Xa6bYSOX99OVwn9LAuPPLqTzyKGtgE7I74IzSfrlQUAWHvaU53JttuhwRj4hUNZpWhflmHfDyjLhHxhX7YXdK\\_b68waPP1g545TNU2lkXrZJWlAiysD8Px6AqA6xPVXqThK7&guccounter=2](https://finance.yahoo.com/news/google-needs-big-bang-breakup-that-would-value-its-businesses-at-37-trillion-as-ai-threatens-search-analyst-171143842.html?guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAADxZpheK3u8TveRxgpzmaZCVXvQ7wAOPpW-pIlY8Xa6bYSOX99OVwn9LAuPPLqTzyKGtgE7I74IzSfrlQUAWHvaU53JttuhwRj4hUNZpWhflmHfDyjLhHxhX7YXdK_b68waPP1g545TNU2lkXrZJWlAiysD8Px6AqA6xPVXqThK7&guccounter=2)",
        "score": 449,
        "comments": 129
    },
    {
        "id": "1kmiq62",
        "title": "$UNH is way oversold",
        "author": "Euro347",
        "created_utc": 1747238095.0,
        "selftext": "Top 5 Reasons its a buy\n\n\\#1 -  UNH is ranked #7 globally for companies by revenue. Revenue was $400B last year\n\n\\#2 - Revenues keeps growing YoY and you get a decent dividend\n\n\\#3 - Lower prescription prices coming will increase profitability. Good for insurance having to pay less, not good for pharma companies.\n\n\\#4 - Health insurance is a necessity, globally\n\n\\#5 -  The AI factor, we see more breakthroughs in healthcare and medicine, less sick people means less insurance payouts but people still need insurance just in case.\n\nI think we bounce to $400 by july 4th\n\nReally hoping Buffett takes a position at this  super low PE",
        "score": 128,
        "comments": 420
    },
    {
        "id": "1kmij7n",
        "title": "What's the deal with sellers?",
        "author": "trading335i",
        "created_utc": 1747237629.0,
        "selftext": "I have been trading for about 5 years. Self taught lost a lot, gained a lot of knowledge from those losses. I stay away from options. \nI have my own strategy and have been fortunate enough to be able to do it full time.\n\nI watch live trades on ADVFN, and I don't understand why when I'm watching a stock with high volume, usually get a constant barrage of sellers offloading when there is clear demand from buyers.\n\nFor example - Shares might be up 3% Premarket, but then there's a sell-off on open and it's down 3% after 5mins. Buyers will be all over it, buying up, and clearly there's demand as it tries to push back up, and would easily climb back to the + 3% it was at pre-market. \nBut even with the demand, sellers seem to keep dumping more in to sell, which just creates a barrier and slows the gains down and it frustrates me 🤣🤦\n\nWhy does this happen? \n\nI can't imagine it being peoples rules triggering (stop loss, take profit etc.), as that would have happened on open and maybe pushed it down the 3% on open. But this happens as it's climbing back up, so there's more buyers than sellers.\n\nIs it bots that are auto trading? or people selling that can't the see the demand volume in live trades?\n\nI just don't understand why the need to sell is, when you could not sell, and watch it climb at least back into the green since demand is there, and sell at a profit.",
        "score": 0,
        "comments": 8
    },
    {
        "id": "1kmi1ki",
        "title": "Anyone invested in SOXL stocks?",
        "author": "Choice-Definition794",
        "created_utc": 1747236430.0,
        "selftext": "Been told by a family in mid April when the SOXL stock was around $7.00 and now it reached 18.70, Anyone knows if I should keep it or pull my money out? From the looks of it, It’s been going well but i’m not an expert. Thank you in advance!  ",
        "score": 2,
        "comments": 15
    },
    {
        "id": "1kmhbrh",
        "title": "Court hearings on tariffs the reason the market has bounced back?",
        "author": "Plane_Employment_930",
        "created_utc": 1747234719.0,
        "selftext": "I had no idea there was a legitimate possibility that the courts would deem the tariffs illegal. This is potentially HUGE news but I'm not seeing much talk about it, am I missing something, is this not a threat to the the tariffs in place? And is this maybe why the market doesn't seem concerned about the 10% global tariffs that are still in place?  \n[https://www.vox.com/economy/412966/supreme-court-tariffs-donald-trump-trade-vos-selections](https://www.vox.com/economy/412966/supreme-court-tariffs-donald-trump-trade-vos-selections)",
        "score": 195,
        "comments": 69
    },
    {
        "id": "1kmgcs8",
        "title": "Is Apple Stock Not Worth it Anymore?!!!",
        "author": "Fearless-Cellist-245",
        "created_utc": 1747232343.0,
        "selftext": "Their vision pro goggles were a big waste of money and they were doing R&D for an EV for 10 years which ended up failing. It looks like their strongest assets are still their phones. I don't think they are innovating enough and its possible they could be the next IBM. MOST notably, they got rear ended by the recent AI boom and haven't been able to catchup. Microsoft, Google, and many other tech giants are innovating towards AI at an alarmingly fast rate, except Apple. Is this stock still worth it, or is it the next IBM?",
        "score": 0,
        "comments": 21
    },
    {
        "id": "1kmfz96",
        "title": "Is SCHD the way in this current market?",
        "author": "Dukkhalife",
        "created_utc": 1747231407.0,
        "selftext": "What are the odds the market goes to new highs in the next 6-8 months?  To me its almost none.  Its kinda crazy that we got here, but going to new heights with what lies ahead for atleast 8 months, its gonna raise and dip for a while.\n\nSCHD at the moment looks almost like a 4% bond, that is about 5-8% undervalued at the moment, in a market that looks like its going to coast for a while.\n\nAlso and this I'm not certain on, but all retirement funds that had to pull out recently due to crazy uncertainty may jump back into funds like schd, providing some natural upliftment....\n\n",
        "score": 0,
        "comments": 53
    },
    {
        "id": "1kmfy24",
        "title": "IPO Timing/ETOR",
        "author": "Upset_Letter275",
        "created_utc": 1747231320.0,
        "selftext": "Hi All\n\nSomewhat new investor, but I’ve never really  engaged with IPOs and I am confused.  \n\nI decided I would take a cautious shot at Etoro (ETOR) which, according to the news, would debut today.  I see I am able to bid on the projected price…but the stock doesn’t appear to be trading.  When does the stock buy and sell as a normal stock?  It’s listed on NASDAQ Global Select.  Any help will be greatly appreciated. Thanks.",
        "score": 0,
        "comments": 3
    }
]{"id": "1kntvfi", "title": "The SP will hit 7000 by year’s end", "author": "InjuryEmbarrassed532", "created_utc": 1747375948.0, "selftext": "I am bullish on the rest of the year, tariffs are a nothing burger that will have no effect on the US tech driven stock market. \nNo one knows what will happen, but in my opinions value and cash bros are about to learn a lesson on par with what they should have already learned starting back in 2010. \n\nSome of the reasons why I think we will reach new highs.\n\n1. De-Dollarization Backfires and U.S. Markets Become the Last Safe Haven\nAs countries diversify away from the U.S. dollar, capital might not flow into gold or emerging markets as expected—but instead flood into U.S. equities, especially large-cap tech. In this view, the U.S. remains the most liquid, transparent, and innovation-driven market. Ironically, global distrust of U.S. fiscal policy could boost stocks as foreign capital chases yield and safety in equities, not Treasuries.\n\n\n2. The AI Productivity Supercycle Is Real (and Underestimated)\nThe market may be on the cusp of a productivity revolution akin to the internet boom—or even greater. The belief is that AI, led by companies like NVIDIA, Microsoft, and Meta, will drive exponential gains in corporate earnings and efficiency. If the market begins to price in several years of accelerated earnings growth now, a melt-up to 7000 becomes plausible, especially with retail and institutional money piling in.\n\n\n3. The U.S. Embraces “Soft MMT” (Modern Monetary Theory)\nWhile outright MMT remains taboo, policymakers may continue to blur the line between fiscal and monetary stimulus—effectively funding government programs via asset markets and Fed balance sheet expansion. A “soft MMT” regime could keep equities buoyant through aggressive infrastructure, AI, or social investment bills funded by yield curve control or disguised QE.\n", "score": 0, "comments": 11}
{"id": "1kns174", "title": "Currently deciding what to do with my cash: HYSA vs SGOV?", "author": "futurespacecadet", "created_utc": 1747368979.0, "selftext": "Right now my HYSA has an annual percentage yield of 3.60%, but after a google search it says SGOV annual yield is currently 4.79%? What the hell?\n\nWhy even have an HYSA at all if this is yielding more? Should I put everything in there?\n\nAlso, how does it work? You just buy SGOV with your brokerage like a regular stock and you start yielding dividends? thanks!", "score": 3, "comments": 3}
{"id": "1knqkt4", "title": "Need some help/guidance.", "author": "CompetitionBoth3684", "created_utc": 1747364192.0, "selftext": "I was hoping for some financial guidance that will put me on the fastest path possible to long term wealth. \n\nA little background. I am 29 years old and turn 30 in 2 months. I am a cop in California and make what I would describe as a “good” income, but not great (about 60k net a year). I drive an older car that runs GREAT and I am very frugal. I am NOT a homeowner but would like to buy my first house by late spring/early summer 2026. I’ve been dating a great girl for about a year and she would like to move in with me and pay me rent when I buy said first house. I currently reside with my parents (typical gen z/younger millennial situation due to this outrageous economy/crazy unaffordable world we’re living in). \n\nMy parents gifted me 10,000 at the age of 17. I have now 12 years later turned that into 190,000 and have that currently parked in a HYSA where I make about 620 dollars of intrest a month. This HYSA will be about 200,000 by mid-august and will only go up from there. I know NOTHING about stocks and/or how to invest my money. Any guidance and/or advice would be greatly appreciated. ", "score": 2, "comments": 15}
{"id": "1knoz01", "title": "High yield savings accounts?", "author": "Arch_Rebel", "created_utc": 1747359046.0, "selftext": "Not really about stocks but I figured it wouldnt hurt to ask here anyway. I’ve got a chunk of cash sitting in a shitty USAA savings account earning like .38% interest. Where can I put it that is safe, will allow me to access it if needed, and will still make me some money? I was thinking about a high yield savings account. Any other suggestions?", "score": 9, "comments": 40}
{"id": "1knm7sy", "title": "Short Foot Locker Now?", "author": "BlueAgain5175", "created_utc": 1747350658.0, "selftext": "Foot Locker shares jumped huge today after the Dicks aquisition news. Only a small amount is left between the current price and the future acquisition price per share. Could this be a reverse arbitrage play if I do my research and believe that the deal will fall through? What is the downside since the Foot Locker stock is unlikely to rise much more? ", "score": 0, "comments": 21}
{"id": "1knl8ab", "title": "Google hits 150 million users for subscription service with help of AI", "author": "joe4942", "created_utc": 1747347889.0, "selftext": "https://www.reuters.com/business/google-hits-150-million-users-subscription-service-with-help-ai-2025-05-15/\n\n> SAN FRANCISCO, May 15 (Reuters) - Alphabet's Google One subscription service, which charges consumers for cloud storage and artificial intelligence features, recently crossed 150 million subscribers, the company told Reuters.\n\n> That represents a 50% increase since February 2024, when Google One crossed 100 million subscriptions nearly six years after the service launched.\n\n> The same month, Google introduced a $19.99 a month plan with access to AI capabilities unavailable for free users. The company continues to offer Google One subscription tiers for file storage, but without most AI features, at lower prices.\n\n> The new AI tier accounted for \"millions\" of subscriptions, according to Shimrit Ben-Yair, a vice president at Google in charge of the subscription service.\n\n> Google One is part of Alphabet's effort to diversify beyond advertising, which accounted for more than three-quarters of its $350 billion in overall 2024 revenue.\n\n> Alphabet's success with subscriptions could play a key role in its long-term financial outlook as it grapples with the threat of AI chatbots, like OpenAI's ChatGPT or Google's own Gemini, to its search engine stronghold.", "score": 149, "comments": 48}
{"id": "1knj7rb", "title": "Michael Burry has sold every stock in his portfolio except for a new position in Estee Lauder, $EL.", "author": "IssaReallyGoodDay", "created_utc": 1747342714.0, "selftext": "Big news from the Big Short legend himself! According to the latest 13F filings, Michael Burry has sold off every single stock in his portfolio except for a brand-new position in Estee Lauder ($EL).\n\nHe’s been wrong multiple times since calling the 2008 short, but this is definitely interesting.", "score": 557, "comments": 124}
{"id": "1knhyrt", "title": "The real problem of the U.S is that if MAG7 is removed, the US stock market will be a flat horizontal line.", "author": "duck4355555", "created_utc": 1747339647.0, "selftext": "\nFrom a professional perspective, this problem has actually seriously affected all aspects of the United States. It can be said that the United States is in a limited-scale 2000 Nasdaq crisis. But this is not a bad thing, but a good thing. It sounds counterintuitive, but if MAG7 shrinks and one of them, such as Tesla, goes bankrupt, then the United States will tighten or introduce a bill that is more stringent than the 404 Act. Restrict disorderly capital. Let more money enter normal industries. This is what MAGA can do.", "score": 0, "comments": 48}
{"id": "1knho1m", "title": "$BULL (Webull) dropped from $19 to $12 — Is this support level or just a pause before more downside?", "author": "Fedor_L", "created_utc": 1747338900.0, "selftext": "Hello traders and investors,\n\nI’ve been following $BULL for a while. A week ago, it looked like it had strong upside potential — especially after it ran up to around $19. But since then, it’s been a steady decline, and now it’s hovering just above $12, which seems to be a key support level based on previous price action. (That's just my opinion)\n\nI haven’t seen much recent discussion about it here, so I’m curious:\n\nIs anyone still bullish on $BULL at these levels?\n\nDo you see any catalysts that could reverse this downtrend?\n\nOr is this support likely to break?\n\nWill be great to see informed opinions and maybe some technical or fundamental takes I haven't considered.\n\nThere is not much financial info about Webull, or I just can't find it..\n\nAppreciate your insights!", "score": 0, "comments": 25}
{"id": "1knfye8", "title": "Storm Ahead? Powell Warns Supply Shocks May Lock In Higher Rates for Years", "author": "ZestSweet", "created_utc": 1747334694.0, "selftext": "Federal Reserve Chair Jerome Powell has signaled a significant shift in the central bank’s monetary policy framework, acknowledging that the current strategy, established in 2020, may no longer be adequate in addressing the evolving economic landscape marked by persistent supply shocks and heightened inflation volatility. ￼\n\nKey Takeaways:\n\n\t* Reassessment of Monetary Policy Framework: Powell announced that the Fed is reevaluating its approach to monetary policy, particularly the average inflation targeting strategy adopted in 2020. This strategy allowed for inflation to exceed the 2% target temporarily to compensate for previous shortfalls. However, the unforeseen surge in inflation post-pandemic has rendered this approach less effective.  ￼\n\n\t* Emergence of Persistent Supply Shocks: The economy is facing more frequent and potentially enduring supply shocks, such as those stemming from tariffs, pandemics, and severe weather events. These shocks pose a dual challenge by simultaneously driving up prices and hindering economic growth, complicating the Fed’s policy decisions.  ￼\n\n\t* Shift Towards Inflation Control: In light of these challenges, Powell indicated a strategic pivot back to prioritizing inflation control. The Fed aims to develop a policy framework that is robust across various economic conditions, ensuring preparedness for potential downturns while maintaining its commitment to a 2% inflation target.  ￼\n\n\t* Implications for Interest Rates: While Powell did not provide specific guidance on immediate interest rate adjustments, the acknowledgment of higher real interest rates and the potential for more volatile inflation suggests that the Fed may maintain elevated rates for an extended period to anchor inflation expectations.\n\nThe Fed plans to unveil the revised policy framework between August and September 2025, aiming to enhance its resilience to unforeseen economic developments while upholding its dual mandate of price stability and maximum employment.  ￼", "score": 372, "comments": 115}
{"id": "1knd5wb", "title": "Turning Water into Wealth - $LB Landbridge Analysis", "author": "thelastsubject123", "created_utc": 1747327980.0, "selftext": "In the past, turning water into wine was considered a biblical miracle. However, with the rise of AI, anyone can now do this incredible feat by investing in Landbridge.\n\nLandbridge is a company that owns land, focusing on the Delaware sub-basin within the Permian Basin. For those unaware, this region is known for having the most active oil and natural gas exploration in the US. If this sounds familiar, its business model and area of activity is similar to the highly successful Teas Pacific ($TPL). However, a massive difference between TPL and LB is LB primarily relies on water royalties for their revenues.\n\nLet's break down their most recent 1Q25 Earnings: [https://s204.q4cdn.com/780627658/files/doc\\_presentation/2025/LandBridge-Q1-25-Earnings-Deck\\_vF.pdf](https://s204.q4cdn.com/780627658/files/doc_presentation/2025/LandBridge-Q1-25-Earnings-Deck_vF.pdf)\n\nRevenue came in at $44M, up 131% YoY. 59% came from royalties of land usage. 33% Came from royalties of sales of water/products obtained from land. Only 8% came from royalties from actual Oil & Gas Production. The bulk of these revenues are due to the water needs of high power data centers. As companies continue to develop $10B+ data centers, the access of water is what enables the usage of these centers, creating a continuous revenue opportunity for LB.\n\nThe key takeaway is Landbridge does not take on any production/capex risk- it is simply a landowner that allows other companies to operate their production on their assets. This makes it an extremely high margin business, making Visa/Nvidia look inefficient.\n\nThe company boasts \"adjusted EBITDA\" margins of 88%. That being said, current GAAP net margins are at 35%, a far cry from the expected 90% management alludes to. This is due to SBC and Interest Expense  due to debt issued to fuel land acquisition. In addition, quarterly FCF is down 40% YoY from $27M to $16M. This is due to a temporary increase in accounts receivable that will be normalized as revenue is recognized.\n\nI personally believe that this is palatable for the moment. There is only so much prime attractive land and I would rather LB acquire it now to generate incredible cash flow in the future. For example, the most recent purchase of Bone Ranch for $245M. This led to a 70% QoQ increase in water royalty volumes and will bring in a MINIMUM of $25M per year for the next 5 years. Again, this is all revenue with essentially 90% margins. These are accretive purchases that will payoff tenfold in the coming years.\n\nAs Landbridge continues to engage in accretive M&A to accelerate high margin revenue, the thesis continues to strengthen alongside the growth of water intensive data centers.", "score": 3, "comments": 5}
{"id": "1kncgdn", "title": "US GDP projections since dec 2024", "author": "You_Will_Fail1", "created_utc": 1747326260.0, "selftext": "Below are the forecasts made for US economy in dec 2024, march 2025 and may 2025.\n\nBefore 2025 there was positive outlook for GDP growth, inflation to come down and even rates to come down. No we have much slower GDP growth, increased inflation and maybe 1 rate cut. The only thing that is better now that it was before 2025 is the value of S&P500.\n\n||\n||\n|Date|18.12.24|19.03.25|15.05.25|\n|GDP growth|2.10 %|1.70 %|1.30 %|\n|PCE inflation|2.50 %|2.70 %|3.10 %|\n|SPY|582.5|565.4|590|", "score": 8, "comments": 1}
{"id": "1kn9q3z", "title": "Your best dividend stocks 2025?", "author": "whatever-bee27", "created_utc": 1747319598.0, "selftext": "I have some money in my account just sitting that I would rather at least be working for me.\n\nWhat are your top dividend stocks? \n\nI've researched the popular ones that come up in a Google search, but curious/getting a feel for what other ones are out there that people like. Not picky about industry. \n\nEdit: Thank you everybody! I'll be looking through all the suggestions - I've got some homework to do now :)", "score": 53, "comments": 137}
{"id": "1kn93dc", "title": "UNH has reached a bottom at $250", "author": "Smartmoney243", "created_utc": 1747318003.0, "selftext": "I am nearly certain this is the bottom on a much over done dip on United Healthcare (UNH). They have an incredible new CEO, and just a “probe” into criminal investigations, they don’t even know if anything was wrong they’re just probing. Even then an investigation could take years and nothing will come of it for a long time. \n\nThis stock is down PAST COVID LOWS. WOW, we will never see it this cheap again. The market is irrational on this, come on the next ER the CEO will set things straight. This is MAX pain and anyone buying here will be greatly rewarded. I have zero doubts. Trust me this is the bottom. Even do a remind me in 1 year, you’ll see how right I was. This is a load the boat moment!", "score": 0, "comments": 88}
{"id": "1kn7vz6", "title": "BREAKING: Walmart to hike prices imminently", "author": "ActuallyMy", "created_utc": 1747314795.0, "selftext": "Earnings Call On prices\n\n\"We will likely see price hikes toward the end of this month and then certainly much more in June,\" per Chief Financial Officer John David Rainey\n\n\n\"We will do our best to keep our prices as low as possible but given the magnitude of the tariffs, even at the reduced levels announced this week, we aren't able to absorb all the pressure given the reality of narrow retail margins,\" \n\nCEO Doug McMillon\n\nAre we cooked? Personally, this market doesn't make sense to me. Originally, I thought it was quite over sold, especially parts of the market, but now I feel like it's gone the other direction. I guess we will see.", "score": 8452, "comments": 941}
{"id": "1kn7ozh", "title": "Coinbase says hackers bribed staff to steal customer data and are demanding $20 million ransom", "author": "WickedSensitiveCrew", "created_utc": 1747314266.0, "selftext": "> Coinbase on Thursday reported that cyber criminals bribed overseas support agents to steal customer data to use in social engineering attacks. The incident may cost Coinbase up to $400 million to fix, the company estimated. The crypto exchange operator received an email on May 11 from someone claiming they obtained information about certain Coinbase customer accounts as well as other internal Coinbase documentation, including materials relating to customer-service and account-management systems, Coinbase reported in an SEC filing. Although passwords and private keys were not compromised, affected data included sensitive data such as names, addresses, phone numbers and emails; masked bank account numbers and identifiers as well as the last four digits of social security numbers; government ID images and account balances, the company said.\n\n> “Cyber criminals bribed and recruited a group of rogue overseas support agents to steal Coinbase customer data to facilitate social engineering attacks,” the company said in a blog post. “These insiders abused their access to customer support systems to steal the account data for a small subset of customers. No passwords, private keys, or funds were exposed and Coinbase Prime accounts are untouched. We will reimburse customers who were tricked into sending funds to the attacker.” Coinbase had detected the breach independently in previous months, per the filing. It immediately terminated the employees involved, warned customers whose information may have been accessed and enhanced its fraud monitoring protections.\n\n> The threat actor paid overseas contractors and employees in support rolls to obtain the information, it said. “We’re cooperating closely with law enforcement to pursue the harshest penalties possible and will not pay the $20 million ransom demand we received,” the company said in the blog. “Instead we are establishing a $20 million reward fund for information leading to the arrest and conviction of the criminals responsible for this attack.” Coinbase operates the largest crypto exchange in the U.S. In that past week it announced an acquisition that is expected to help it expand its global reach and gained entry to the benchmark S&P 500 stock index, which will take effect next week.\n\nhttps://www.cnbc.com/2025/05/15/coinbase-says-hackers-bribed-staff-to-steal-customer-data-and-are-demanding-20-million-ransom.html", "score": 400, "comments": 50}
{"id": "1kn7o0m", "title": "(05/15) Interesting Stocks Today - DOJ investigating UNH!", "author": "WinningWatchlist", "created_utc": 1747314194.0, "selftext": "This is a daily watchlist for short-term trading: I might trade all/none of the stocks listed, and even stocks not listed! I am targeting potentially good candidates for short-term trading; I have no opinion on them as investments. The potential of the stock moving today is what makes it interesting, everything else is secondary.\n\nNews: [Trump Wants Apple To Stop Moving Iphone Production To India](https://www.bloomberg.com/news/articles/2025-05-15/trump-wants-apple-to-stop-moving-iphone-production-to-india)\n\n[**UNH (UnitedHealth)**](https://finviz.com/quote.ashx?t=UNH&p=d) \\- The U.S. Department of Justice is conducting a criminal investigation into UnitedHealth Group for \"potential Medicare fraud\" related to its Medicare Advantage business. The probe, active since at least last summer, is looking into \"questionable diagnoses\" to inflate payments from Medicare. UNH dropped close to 40 points yesterday afterhours. Not sure if it'll continue but short biased unless we make some insane move downward even more. The spike premarket was attributed to them denying the news. This news is particularly bad because DOJ confirmed investigation is criminal. Other stocks such as HUM/CVS/CI have moved on this as well.\n\n[**ETOR (eToro)**](https://finviz.com/quote.ashx?t=ETOR&p=d) \\- eToro's IPO priced at \\~$68 per share, above the expected range of $46–$50, and the stock bounced off \\~$65 off some strong bids. Mainly interested to see if the strong bids at $65 still exist (unlikely but I'll just keep an eye out anyway). Mainly a sector play in C-brokerages and the C-Market, since most of their income is derived from it. Beyond what I highlighted in the IPO analysis post, not interested in this long term. Probably will just trade as a proxy to the C-market in the future and I don't like the structure of their contract for diffs.\n\n[**BABA (Alibaba)**](https://finviz.com/quote.ashx?t=BABA&p=d) \\- Alibaba reported Q4 revenue of 236.45B yuan, a 7% increase year-over-year, but slightly below analyst expectations of 237.91B yuan. Income from operations nearly doubled to 28.47B yuan driven by improved efficiency and reduced share-based compensation. This has been on a decent run since April 8th (peak fear tariff selloffs). Watching $125 level. Alibaba's cloud division saw an 18% revenue increase, with AI-related product sales posting triple-digit growth.\n\n[**FL (Foot Locker)**](https://finviz.com/quote.ashx?t=FL&p=d) \\- Dick’s Sporting Goods (DKS) confirmed a $2.4B acquisition of Foot Locker at $24 per share, nearly double Foot Locker's previous closing price. Currently long and interested in seeing if we can converge even closer to $24, but overall don't see any other trade in this except for a reversal of news. Mainly integration challenges and potential antitrust concerns are the big risk, but unlikely with current admin.\n\n[**TSLA (Tesla)**](https://finviz.com/quote.ashx?t=TSLA&p=d) \\- Tesla's stock has risen from $275 to $350 over the past six days but failed to break the $350 level twice. Currently short pretty close to $350, but will bail if we break $350 (probably a lower price level like $345). TSLA has mainly been on a tear (attributed to Musk stepping away from DOGE and returning to TSLA), and the news of Tesla board exploring a new pay deal for the CEO dropped yesterday. Mainly a short play based on how parabolic the stock has been, but will bail as needed.", "score": 14, "comments": 10}
{"id": "1kn749a", "title": "No way Musk gets $50B. In my Aussie MBA, the US’s 300:1 pay ratio is taught as the most extreme example of inequality and company governance", "author": "duck4355555", "created_utc": 1747312624.0, "selftext": "One reason is the CEO PAY RATIO, and the other reason is corporate governance. Tesla's management is mostly Musk's cronies, and it has lost its public nature. I had a serious discussion with many Tesla fans on Twitter Space in 2023. They think I am a stupid European old continent style professional manager. What public nature, what small and medium shareholders' interests. The great Musk leads Tesla to one milestone after another, which is a victory. Selling so many Tesla cars is a victory, and launching rockets again and again is a victory, why not pay salaries. A person with only a few hundred shares actually sued a key figure who made the United States great, and it was approved. This is a joke.\n\nI mentioned the CEO PAY RATIO and the responsibility and morality of enterprises to society, which attracted more Tesla fans, including typical investors on Reddit who think that there is no European old continent in the United States, including the stupid morality of the old world like Australia, which is a joke. In the United States, only whoever makes money is the most powerful. No need to reason, just show the holdings, full of social Darwinism theory, if you believe in Tesla, buy CALL, if you don't believe, buy PUT, why discuss science, why discuss technology and implementation routes, no need, these are all jokes. And there is no scientific spirit, just shout orders.\n\nBut in fact, when I think back to 2017, when I was attending an MBA course at a very small school in Australia, the teacher talked about the concept of CEO Pay Ratio, saying that American companies are as high as 300:1. That is, the gap between grassroots employees and CEOs is 300 times. And the UK, a bad country in Europe, is only 70-100 times. I knew that this salary would not satisfy Musk. Because if Musk's salary is really approved, it will bring the US Pay Ratio to an incredible level. The United States has completely lost any morality.\n\nAlthough the United States is indeed a country where everything is about money and whoever has money is the king, I also see that the strong Delaware judges are trying to maintain the final decency of the judiciary to give social fairness.\n\nCompared to the SEC, which weakly sued Musk and was even broken by Musk, the Delaware judge is the last and best shield of the United States.\n\nThe SEC is a regulatory unit that lacks even the most basic dignity and is far weaker than China's Securities Regulatory Commission.", "score": 481, "comments": 175}
{"id": "1kn72yt", "title": "PPI for final demand decreases 0.5% in April; services decline 0.7%, goods unchanged", "author": "tnguyen5057", "created_utc": 1747312518.0, "selftext": "The Producer Price Index for final demand fell 0.5 percent in April. Prices for final demand services decreased 0.7 percent, while the index for final demand goods was unchanged. On an unadjusted basis, the index for final demand rose 2.4 percent for the 12 months ended in April.\n\nhttps://www.bls.gov/ppi/", "score": 228, "comments": 82}
{"id": "1kn6dhd", "title": "Dick’s Sporting Goods to buy Foot Locker for $2.4 billion", "author": "_hiddenscout", "created_utc": 1747310394.0, "selftext": "Dick’s Sporting Goods has agreed to buy smaller rival Foot Lockerfor $2.4 billion, the second major footwear deal this month after the buyout of Skechers, as U.S. retailers look to navigate a tough demand landscape.\n\nThe sporting goods retailer has offered $24 per share of Foot Locker, the companies said on Thursday, representing an 86% premium to the stock’s last close.\n\nShares of Foot Locker surged 82% to $23.45 in premarket trading, after losing about 40% in the year so far. Dick’s Sporting Goods fell 8%.\n\nThe acquisition, Dick’s largest deal in the sporting goods industry, will help the company boost its presence in malls and expand to international markets for the first time, positioning the retailer to better tackle a slowdown in consumer spending.\n\nSeveral U.S. retailers have issued gloomy forecasts in recent weeks as the Trump administration’s hefty tariffs have forced Americans to tighten spending in anticipation of potentially higher prices on everything from household staples to toys and apparel.\n\nOver the last few years, Foot Locker has lost market share to competition from brands such as Nike and Under Armour, which have expanded their direct-to-consumer business, as well as falling customer visits to indoor malls, where most Foot Locker stores are located.\n\nIt operates 2,400 retail stores across 20 countries in markets including North America, Europe and Asia, and logged worldwide sales of $8 billion last year.\n\nhttps://www.cnbc.com/2025/05/15/dicks-sporting-goods-to-buy-foot-locker.html\n", "score": 96, "comments": 34}
{"id": "1kn6as3", "title": "Walmart CFO says price hikes from tariffs could start later this month, as retailer beats on earnings", "author": "WickedSensitiveCrew", "created_utc": 1747310149.0, "selftext": "https://www.cnbc.com/2025/05/15/walmart-wmt-q1-2026-earnings.html\n\n\n> Walmart on Thursday fell just short of quarterly sales estimates, as even the world’s largest retailer said it would feel the pinch of higher tariffs.  Even so, the Arkansas-based discounter stuck by its full-year forecast, which calls for sales to grow 3% to 4% and adjusted earnings of $2.50 to $2.60 per share for the fiscal year. That cautious profit outlook had disappointed Wall Street in February. Walmart also marked a milestone: It posted its first profitable quarter for its e-commerce business both in the U.S. and globally. The business has benefitted from the growth of higher-margin moneymakers, including online advertising and Walmart’s third-party marketplace.  In an interview with CNBC, Chief Financial Officer John David Rainey said tariffs are “still too high” – even with the recently announced agreement to lower duties on imports from China to 30% for 90 days. \n\n> “We’re wired for everyday low prices, but the magnitude of these increases is more than any retailer can absorb,” he said. “It’s more than any supplier can absorb. And so I’m concerned that consumer is going to start seeing higher prices. You’ll begin to see that, likely towards the tail end of this month, and then certainly much more in June.” Walmart said it expects net sales to increase 3.5% to 4.5% for the fiscal second quarter, but declined to provide guidance for earning per share or operating income growth because of fluctuating U.S. tariff policy.\n\n> Here is what the big-box retailer reported for the three-month period that ended May 2 compared with Wall Street’s estimates, according to a survey of analysts by LSEG:\n\n- Earnings per share: 61 cents, adjusted vs. 58 cents expected\n\n- Revenue: $165.61 billion vs. $165.84 billion expected\n\n> In the fiscal first quarter, Walmart’s net income fell to $4.49 billion, or 56 cents per share, compared with $5.10 billion, or 63 cents per share, in the year-ago quarter. Revenue rose about 2.5% from $161.51 billion in the year-ago period, but had a 1% headwind from lapping Leap Day in the year-ago period. Yet it marked Walmart’s first quarterly revenue miss since February 2020. Comparable sales – an industry metric also known as same-store sales – jumped 4.5% for Walmart U.S. and 6.7% for Sam’s Club, excluding fuel. E-commerce sales increased 21% in the U.S., marking the 12th straight quarter of double-digit gains. Global e-commerce sales jumped 22% year over year.\n\n> Walmart is often seen as a barometer for the health of the U.S. consumer because of its thousands of stores and large customer base that cuts across age, income and region. Rainey told CNBC that Walmart has not seen a noticeable shift in consumer behavior from previous quarters. “They’re discerning. They’re mindful. They’re maybe a little concerned about possible looming price increases, but their behaviors largely have not changed. They’re still looking for value,” he said. Still, he said, Walmart plans to “play offense” by keeping its price gaps below competitors. He said the company will absorb some of the higher prices from tariffs and expects suppliers will, too.\n\n> Unlike some of its peers, Walmart has advantages that have helped it better weather an uncertain economy and woo a more selective U.S. consumer. As the nation’s largest grocer, it sells food and necessities that drive steadier store and website traffic. And as a well-known value player, it can use lower prices to attract even middle- and upper-income customers who want to pay less. Already, Walmart has attracted wealthier shoppers with faster deliveries, store remodels and a wider assortment of brands.", "score": 230, "comments": 37}
{"id": "1kn5hfh", "title": "United health care stock ruined my life", "author": "Smartmoney243", "created_utc": 1747307324.0, "selftext": "I bought the dip early on UNH stock on margin and now I’m on the edge of a margin call. This stock is cheaper than I could’ve possibly imagined and I believe buying at these levels is nearly zero risk. The worst is priced in. \n\nI am going to borrow more money anyway I can. This is officially the bottom. It will not go under $250 EVER. I will trick my aging parents into lending me at least $100k to buy this dip, max out credit cards, the typical stuff…. Buying the dip and digging in deeper is the ONLY WAY to salvation. Should I double down as much as I can till I have nothing left? ARE WE NEAR THE BOTTOM ON UNH? I might rope if this goes wrong ", "score": 0, "comments": 41}
{"id": "1kn507n", "title": "After shares of Reddit jumped more than 11% on Wednesday, CNBC’s Jim Cramer explained why he’s enthusiastic about the company’s future.", "author": "FreeCelery8496", "created_utc": 1747305523.0, "selftext": "He recommended investors buy Reddit, but only if they have substantial risk tolerance.\n\n“While I think Reddit’s absolutely worth buying at these levels, even after today’s monster move, stocks like these are only worth owning if you can stomach some serious volatility like we’re having right now,” he said. “Keep in mind, we’re always one presidential tweet — or whatever you want to call it — away from these kinds of names falling out of favor all over again.”\n\nDespite the day’s gains, Cramer surmised that there’s still a buying opportunity because the stock is down substantially from its February highs.\n\nAlthough the platform’s stock didn’t start to climb after it posted earnings at the beginning of May, Cramer found the results impressive. Reddit comfortably beat Wall Street’s expectations for earnings and revenue.", "score": 16, "comments": 53}
{"id": "1kn4utg", "title": "Who wins the robotaxi race - WAYMO or Tesla?", "author": "AnimeInvesting", "created_utc": 1747304946.0, "selftext": "BIG QUESTION ready for discussion - as there is so much momentum behind TESLA and Musk' statements around the Robotaxi and FSD.\n\nWaymo seems to be far ahead of Tesla and has 1.500 cars on the streets in 4 big US cities, while Musk talks about 10-20 cars to be placed in June/July in Austin.\n\nWaymo now reached 250k rides per week, a steep incline from 150k in Oct 2024 and 50k in May 2024.\n\n[https://www.forbes.com/sites/alanohnsman/2025/05/05/inside-the-waymo-factory-building-a-robotaxi-future/](https://www.forbes.com/sites/alanohnsman/2025/05/05/inside-the-waymo-factory-building-a-robotaxi-future/)\n\n“In fact, these vehicles can pick up their first public passengers less than 30 minutes after leaving the factory,” Waymo said in its blog post. The company said that vehicles intended for other cities can be deployed into public service in a matter of hours after being shipped to their local depot.\n\nBesides, questions remains on \"camera only\"-concept of Tesla competing with camera/LIDAR/radar of others. Others deem camera only concept to be unsafe in conditions like rain and fog. Telsa is rumoured to have hit a dead end road with this concept.\n\nJohn Krafcik, former Waymo CEO, clapped back, telling Business Insider, \"Tesla has never competed with Waymo — they've never sold a robotaxi ride to a public rider, but they've sold a lot of cars.\" His email continued, \"And although Tesla hopes to compete with Waymo someday, they've failed utterly and completely at this for each of the 10 years they've been talking about it.\"\n\nWhat do you think?\n\n", "score": 107, "comments": 271}
{"id": "1kn3z2q", "title": "r/Stocks Daily Discussion & Options Trading Thursday - May 15, 2025", "author": "AutoModerator", "created_utc": 1747301433.0, "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on stock options, but if options aren't your thing then just ignore the theme.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nRequired info to start understanding options:\n\n* [Call option Investopedia video](https://www.investopedia.com/terms/c/calloption.asp) basically a call option allows you to buy 100 shares of a stock at a certain price (strike price), but without the obligation to buy\n* [Put option Investopedia video](https://www.investopedia.com/terms/p/putoption.asp) a put option allows you to sell 100 shares of a stock at a certain price (strike price), but without the obligation to sell\n* Writing options switches the obligation to you and you'll be forced to buy someone else's shares (writing puts) or sell your shares (writing calls)\n\nSee the following word cloud and click through for the wiki:\n\n[Call option - Put option - Exercising an option - Strike price - ITM - OTM - ATM - Long options - Short options - Combo - Debit - Credit or Premium - Covered call - Naked - Debit call spread - Credit call spread - Strangle - Iron condor - Vertical debit spreads - Iron Fly](https://www.reddit.com/r/stocks/wiki/options-themed-post)\n\nIf you have a basic question, for example \"what is delta,\" then google \"investopedia delta\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&restrict_sr=on&sort=new&t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&restrict_sr=on&include_over_18=on&sort=new&t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&restrict_sr=on&include_over_18=on&sort=new&t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&restrict_sr=on&include_over_18=on&sort=new&t=all) Friday.", "score": 16, "comments": 603}
{"id": "1kn1g08", "title": "Purely rational: Tesla robotaxi without L4 isn’t even a Challenger — Magic Quadrant shows how far it is from Waymo’s leadership", "author": "duck4355555", "created_utc": 1747290628.0, "selftext": "\n\n||\n||\n|**Leaders**|WAYMO|\n|**Challengers**|Cruise|\n|**Visionaries**|Zoox,AutoX|\n|**Niche Players**|Tesla Robotaxi，Pony.ai|\n\n\n\nIn our business analysis, there is a method called Gartner Magic Quadrants. If a normal analyst puts Tesla's CyberCAB product in this analysis method, he will only have one position, that is, NichePlayers, and even this is overestimating Tesla. After all, Waymo officially has L4 level autonomous driving, while Tesla's FSD is only L2 (in case you haven't heard, Tesla's FSD is only L2, not even L3).\n\n\n\nWaymo is obviously in the leader quadrant. It has launched fully autonomous Robotaxis in Phoenix and San Francisco. It has been successfully running for six years since 2019, although there have been many funny accidents during this period. But Waymo at least dares to claim that it has L4, not L3, or L3 plus, or like FSD, which is obviously L2 but induces the driver to let go. (By the way, L2 allows the driver to take both hands off the steering wheel, and only the United States can do this in the world).\n\nSo Tesla doesn't even have L4 autonomous driving, so what can it use to compete with Waymo, which dares to apply for L4 and uses lidar technology that is ridiculed by Tesla fans. L2 means that the responsibility is put on the driver, but L4 requires Waymo to pay for every accident with real money.\n\nAs of 15/May/2025 (sorry, we are used to typing dates like this in Australia). Tesla has not submitted an application for L4 autonomous driving, so I would like to ask Tesla fans. What will they use to make Cybercab on June 19? Of course, Musk's good friend, a gentleman in the White House, may be able to slam the table and roar angrily, demanding that NHTSA officials unconditionally let his best political allies and election campaigners start Robotaxi business immediately.\n\n\n\nFrom my perspective, the US stock market really feels like the Nasdaq bubble in 2000. It is full of lies and incompetence at the regulatory level. The entire market is either VR, AR or AI, quantum chips (here again, quantum algorithms do not solve the problem of general computing. Before 2022, there were many research projects in the United States to study how to accelerate quantum computing for general computing, and they all failed), autonomous driving, and cryptocurrency. Remove MAG7, where is the value of the United States?\n\nIn my opinion, Europe is better than the United States. The European academic community does not brag about AI, but focuses on researching colliders.\n\nI once asked a friend from NASA, \"Why don't you launch more deep space satellites to explore the universe?\" Their answer was \"Space science is not like Silicon Valley, where you can just blow bubbles. Space research requires a lot of objective conditions, and these objective conditions are calculated based on decades or even hundreds of years, such as planets connecting in a straight line. This kind of opportunity requires a long wait, and before the astronomical conditions are met, there is very little that humans can do).\n\nI will write about the current AI scams when I have time, which is also a purely rational analysis.\n\nFinally, I want to thank the administrators here. I have been banned in several forums for telling the truth.", "score": 40, "comments": 10}
{"id": "1kn14fw", "title": "Take on Take two interactive shares", "author": "rikzer09", "created_utc": 1747289357.0, "selftext": "So as everyone knows that GTA6 is around the corner and Rockstar Games will keep teasing it until its release next year, so Planning to purchase Take two interactive shares (it's my first stock I will buy) yes people will say it won't rack up but with its huge anticipation & the game will be a masterpiece in itself (which I can guarantee as me being a gamer half of my life) which can surely make the company a more dominant one in its industry.  And apart from that putting money onto a good index funds which can yield some dividend as well. So what do experts here have to say on that huge release and how it will change or affect the market.....TIA", "score": 12, "comments": 29}
{"id": "1kn1087", "title": "Goldman Sach not reporting trades", "author": "Mouse1701", "created_utc": 1747288886.0, "selftext": "Reuters NEW YORK, May 14 (Reuters) - Goldman Sachs (GS.N), opens new tab will pay a $1.45 million civil fine to settle a U.S. regulator's claims that the Wall Street bank failed to accurately report data for billions of stock market trades.\n\nThe Financial Industry Regulatory Authority said in a consent order on Tuesday that coding errors at Goldman led to inaccurate reporting of 36.6 billion trades to the CAT Central Repository, which helps the regulator monitor markets.\n\nCAT is an acronym for consolidated audit trail.\nFINRA also said a technology failure caused Goldman in October and November 2021 to inaccurately prepare 90.8 million order memoranda, report 6.9 million trades and issue more than 372,000 trade confirmations. \n\nIt said the failure also led Goldman to report 98,322 trades it should not have reported.\nThe settlement also addresses alleged supervisory failures.", "score": 56, "comments": 14}
{"id": "1kmzqgq", "title": "Does investing really make you wealthy?", "author": "-TheRandomizer-", "created_utc": 1747284103.0, "selftext": "Was just thinking about this today, the general rule of thumb is to invest in the S&P 500 passively, to return on average 7% a year. This is great and all, but, if everyone does this, no one gets rich off it. If myself and everyone else in a country invests, no one gets ahead. This seems more like a defensive measure than a wealth building tool. Thoughts?", "score": 0, "comments": 34}
{"id": "1kmyh7c", "title": "CoreWeave reports more than 400% growth in its first earnings", "author": "StocksTok", "created_utc": 1747279798.0, "selftext": "Artificial intelligence infrastructure provider CoreWeave reported better-than-expected revenue on Wednesday in the company’s first earnings release since going public. The company reported revenue of $981.6 million, compared to expectations of $853 million, and -$1.49 EPS.\n\nRevenue soared 420% in the quarter, which ended on March 31, from $188.7 million a year ago, according to a statement. That compares with 737% growth for all of 2024. The company’s net loss of $314.6 million widened from $129.2 million a year earlier, partly because of $177 million in stock-based compensation costs for awards tied to the initial public offering.\n\nCoreWeave sees $4.9 billion to $5.1 billion in 2025 revenue, which implies a growth rate of 363%. That growth requires hefty capital expenditures. The company expects capex of $20 billion to $23 billion for the year. The range includes impact from OpenAI and other factors. Analysts surveyed by LSEG had anticipated $4.61 billion in full-year revenue.\n\n[CNBC Article](https://www.cnbc.com/2025/05/14/coreweave-crwv-q1-2025-earnings-report.html)", "score": 28, "comments": 6}
{"id": "1kmyehf", "title": "Boeing's record-breaking deal: Qatar Airways to buy up to 210 planes", "author": "StocksTok", "created_utc": 1747279540.0, "selftext": "Boeing and Qatar Airways on Wednesday announced a deal for the Middle Eastern airline to buy up to 210 jets, notching the U.S. planemaker’s largest-ever order of widebody aircraft. The order — the biggest in Qatar Airways’ history — includes 130 of Boeing’s 787 Dreamliners and 30 of its much-delayed 777-9s, with options for up to 50 more planes, the companies said in a press release.\n\nQatar Airways also signed an agreement with GE Aerospace for more than 400 engines to power the Boeing planes, those companies said in another joint release. The purchase of widebody aircraft engines is the largest in GE Aerospace’s history, according to the release.\n\nBoeing CEO Kelly Ortberg appeared alongside Trump at the Amiri Diwan in Doha for the signing ceremony. “This is a critical next step for Qatar Airways on our path as we invest in the cleanest, youngest and most efficient fleet in global aviation,” Qatar Airways CEO Badr Mohammed Al-Meer said in a statement. “This is so we can meet the strong demand in the airline as we seamlessly connect passengers to the world better than anyone.”\n\nBoeing Commercial Airplanes CEO Stephanie Pope said the “record-breaking order” with Qatar Airways “solidifies their future fleet with our market-leading widebody airplane family at its center.”\n\n[CNBC Article](https://www.cnbc.com/2025/05/14/boeing-qatar-trump-plane-deal.html)", "score": 495, "comments": 154}
{"id": "1kmxgbf", "title": "Regarding the UNH criminal probe, look at the WellCare fraud for clues of the Armageddon scenario.", "author": "puukkeriro", "created_utc": 1747276511.0, "selftext": "Back in 2007, criminal charges were bought against WellCare and its executives for defrauding Florida's Medicaid program. \n\nhttps://www.justice.gov/archives/opa/pr/four-former-wellcare-executives-found-guilty-florida\n\nIt's stock ticker is WCG, and you can find a historical chart here:\n\nhttps://www.barchart.com/stocks/quotes/WCG/interactive-chart\n\nIn October 23, 2007, the Justice Department announced charges against the company and the stock dropped from $115 to $20 over a few days, a loss of 82%. It eventually stabilized in the $30 range before going back down into the single digits during the Great Recession. However, it recovered back to its previous price levels by 2017 and reached $350 in 2021 before being acquired. \n\nSo... if the worst happens to UNH (e.g., criminal probe where charges are filed and the government brings the hammer against the company and wins), expect this to go way below $200 and stay there for a long time.\n\nBut of course, such prosecution of corporate fraud is quite rare so take that as you will. I think UNH will ride this one out as it's too big to fail.", "score": 87, "comments": 34}
{"id": "1kmwtpi", "title": "Safety of Index Funds", "author": "Agile-Technology-209", "created_utc": 1747274560.0, "selftext": "What do we think is the future for index funds like VTI? Am currently 24, looking at a 40 year timespan. Is it really that easy to just put in 300+ a month into VTI, and it’ll grow a large amount in the future? New to investing, just started this year. If it’s so easy to just invest in index funds, why doesn’t everyone do it? Currently it trades at around 285, how much should we expect in 40 years? 2000+?", "score": 0, "comments": 26}
{"id": "1kmw8bi", "title": "Borrowing HELOC to invest?", "author": "TheCuriousBread", "created_utc": 1747272752.0, "selftext": "With the home paid off and the HELOC just collecting dust. I'm thinking of deploying some risk capital into the game.\n\nNow as someone who's 30. I find myself conflicted.\n\nI COULD invest in high growth stocks which would probably return 10%+ over the next 30 years. However I will be eating the interest cost for 30 years cos they don't pay shit.\n\nI COULD invest in dividend stocks which will yield 4-5% over the next 30 years meanwhile probably growing like ....nothing at all, 1,2% pa but on the flip side I don't pay the interest. The dividend accounts for it. Since I'm losing most of my div to interest cost, I can't DRIP and since the stocks are only growing 1-2% pa, realistically I'm only getting 2-4% extra meanwhile risking everything including the house.", "score": 0, "comments": 20}
{"id": "1kmvgj4", "title": "In my opinion, 06/19, CyberCab is released, and the world will know that Tesla is the second Enron", "author": "duck4355555", "created_utc": 1747270364.0, "selftext": "I am a long-term Chinese investor. I have been firmly bearish on Tesla for four years and have been laughed at by other investors for four years. But I am firm in my opinion because I am different from other investors. I have two undergraduate degrees in IT and economics, and I am also a mechanical enthusiast in my spare time. I understand mechanics, economics and IT better than others. I believe that the release date of Cybercab will be another Enron and Tesla's doomsday. How can it be achieved unless his good friend, the president, helps.\n\nAll the achievements of BEV today are based on government subsidies. In 2024, after the European government cancelled the BEV subsidies, the sales of hybrid and Toyota immediately increased. So when countries around the world gradually canceled the subsidies for electric vehicles in the next few years, who will buy them? Of course, the president's friends can ask the federal government to buy them at the government level.\n\nToday, Tesla's market value is higher than Toyota, GM and Honda. This is really a joke.\n\nMany people also told me that \"Tesla is not just a car company, it is the future, Mars, artificial intelligence, and innate intelligence. It will replace all humans.\"\n\nI don't want to discuss this topic with people who have no science and engineering background anymore. Really, there is a saying in China that \"if you don't cheat a fool's money, it's a waste.\" These people are the same.\n\nSometimes I really feel strange about the US stock market. The SEC is like a thing that bullies the weak and clings to the powerful. On the contrary, even the China Banking Regulatory Commission, which is called the \"fraud market\", has always been a heavy-handed strike in regulating companies. It's just that it must cooperate with the Chinese government to control stock prices and the stock market, but it has never been afraid of any company. And the SEC is too weak.", "score": 138, "comments": 179}
{"id": "1kmua7t", "title": "UNH feels like the new TSLA", "author": "Draymond_Punch", "created_utc": 1747266812.0, "selftext": "Ruined public image plus one bad news after another. And being oversold as a result. I wish I had jumpped on TSLA when it went down to the low 200s. And now I'm wondering if I'm making the same mistake not trying to catch the falling knife that is UNH.", "score": 0, "comments": 42}
{"id": "1kmtb1q", "title": "UnitedHealthcare Under Criminal Investigation", "author": "BernoulliCat", "created_utc": 1747264026.0, "selftext": "According to a recent WSJ exclusive, the Justice Department is investigating UnitedHealth Group for possible criminal Medicare fraud.\n\nWhile the exact nature of the potential criminal allegations against UnitedHealth is unclear, the people said the federal investigation is focusing on the company’s Medicare Advantage business practices.\n\nThe bad news just keeps on piling.. puts at market open wouldn’t be a bad idea, ha.", "score": 1370, "comments": 165}
{"id": "1kmrfnb", "title": "Why would anybody buy 0,5% 10 year T-bonds in 2022 when inflation was 8% over TIPS", "author": "revaz125125", "created_utc": 1747258973.0, "selftext": "As the title says, I've been trying to figure out this topic with chatgpt over the past hour and a half and it keeps repeating itself but either I'm dumb or chatgpt doesn't understand what I'm asking.\n\nI've been going over the SVB case, and couldn't wrap my head around as to why would they commit such big funds in 0,5% T-bonds over TIPS, or simply commit at all at such low yields (+had they hedged against the risks the upside would pretty much be offset and the investment would maybe breakeven). I understand that they are risk free and offer liquidity and all that, but why not just go with Tips, at this point with such high inflation (around 8% in 2022) maybe I'm wrong or missing something (probably the other) but isn't it a pretty much a guarantee that over the next 10 years, the average inflation would be over 0,5% and that would make the second more attractive? Somebody please help me understand this.\n\nEdit: I understand that the real yield aka coupon payment on tips is much lower, but still the principal gain is much higher", "score": 44, "comments": 42}
{"id": "1kmpdjt", "title": "So nvidia is now 3.3T and the most valuable company on the market?", "author": "Relative_Drop3216", "created_utc": 1747253920.0, "selftext": "Many people say this company is not overvalued, can we really value this company as the most valuable or are we getting ahead of ourselves?\n\nSeems risky buying nvidia at AH with the context of everything going on. ", "score": 392, "comments": 191}
{"id": "1kmoexe", "title": "Short Interest viewable on Schwab or ToS?", "author": "giovannigiannis", "created_utc": 1747251587.0, "selftext": "I am learning about short interest, which, as I understand, is a measure of how many people are betting that a stock will go down. \n\nIs there a metric on the Schwab app (or ThinkOrSwim app) that will show you this metric?\n\nI use ToS app, and they have a lot of useful tabs showing a bunch of different metrics, most of which I do not understand.  But S I am coming to understand this short interest concept, I’d like to keep an eye on it.  I just don’t know where to go to find this information.  I know there are methods for calculating it, but that alone tells me that there must be a service somewhere that tabulates it automatically. Anyone know where I can find it?  As I said, I hope ToS or Schwab app have it. ", "score": 6, "comments": 2}
{"id": "1kmn37m", "title": "The emotional chaos of selling a stock that’s ripping - Advice on taking profits", "author": "10baggerss", "created_utc": 1747248396.0, "selftext": "I don’t think enough people talk about how hard it is to sell when you’re actually up big on a position.\n\nEveryone’s always focused on the entry. What’s the next 5x? What are you buying? But honestly, I’ve found the real challenge is knowing what to do once something you own starts ripping.\n\nI’ve had this happen a few times now. I’d get in early on something, maybe just messing around with a small position, and then suddenly it’s up 200%, 300%, sometimes more. And I’d love to say I calmly trimmed, locked in profit, and moved on. But that’s not how it went.\n\nUsually you start getting emotional. You feel smart. You tell yourself it’s going higher. You start thinking about what your gain could be if you just held a little longer. Sometimes you even add more. I’ve done that. Then it pulls back 40%, and now you’re stuck. Selling feels wrong. Holding feels worse. You just sit there watching it bleed.\n\nOne thing that’s helped me is trying to think of selling the same way I think about buying. When a position gets big and my portfolio value starts growing fast, I’ll stop and ask: “If I didn’t own this stock right now, would I be comfortable putting this amount of money into it at this current price and chart?”\n\nMost of the time, the answer is no. That’s when I know I probably need to trim. I don’t want one name becoming way too outsized just because I’m emotionally tied to it. Rebalancing feels more like a risk management decision than some emotional call to dump the stock. And honestly, it helps a lot.\n\nAnother thing is selling in chunks. I might trim a bit after a double. More if it keeps going. That way I’m locking something in but still giving it room to run. I try not to beat myself up if it goes higher after I sell. That’s just part of the game.\n\nI’ve still made plenty of mistakes. I’ve round-tripped some great trades because I got greedy or froze. But I’m starting to learn that having some kind of exit mindset early on makes everything easier. Even just writing down a rough plan or price target helps take the edge off when it comes time to decide.\n\nAnyway, just sharing my experience. If you’ve ever held too long, sold too early, or felt stuck on what to do when you’re up big, you’re definitely not the only one. Curious how other people think about this stuff too.", "score": 71, "comments": 84}
{"id": "1kmks0z", "title": "Tesla Institutional Investor Movement- Mixed Bag- Mostly Positive", "author": "iD-10T_usererror", "created_utc": 1747242937.0, "selftext": "I said I would post when the latest release of institutional holdings on Tesla to come out to see if the \"smart money\" had any change in sentiment. The answer seems to be: Not really. If anything, there are some large institutional investors showing continued bullish trends, with a few even becoming wildly bullish and making huge moves, clearly expecting lots of upside. And I am a Tesla bear holding a battered short position but trying to remain at least a little objective on this matter. If this is what the \"smart money\" is doing, it doesn't look good for the bears.\n\nFrom the previous round of reports posted on the Nasdaq website, overall institutional ownership increased 1.11% from 47.37% to 48.48%. Additionally, the total number of institutional holders increased 1.75%, from 4020 to 4091. Just looking at the 3/31/25 filing date, there were 138 firms that opened new positions and 362 that completely closed their positions. Most firms that were both opening new positions and closing positions were relatively small in terms of total shares bought/sold with the exception of Nuveen, which opened a huge new position (listed below).\n\nI don't have access to the raw data but here are some notable moves from the 3/31/25 (submitted/visible 45-days after) reporting date of the larger firms that have substantial holdings of Tesla that are at least in the billions.\n\n**Buyers (shares/% increase in overall position):**\n\n|Institution|Shares Added|Percent Increase in Position|\n|:-|:-|:-|\n|Vanguard|3,694,524|1.519%|\n|Blackrock|3,482,055|1.722%|\n|Geode Capital Management|2,487,085|4.076%|\n|JPM\\*|3,426,144|9.52%|\n|Goldman Sachs|14,670,839|123.081%|\n|Charles Schwab|849,091|4.901%|\n|Invesco|2,211,300|17.585%|\n|Nuveen|12,531,327|new|\n|Citigroup|3,611,937|47.184%|\n|Deutsche Bank|1,733,531|20.778%|\n|Assenagon Asset Management|2,978,026|54.277%|\n|Sumitomo Mitsui Trust Group|456,356|5.793%|\n|Swiss National Bank|26,100|0.321%|\n|Hsbc Holdings|19,426|0.242%|\n|National Bank Of Canada\\*|5,566,098|307.721%|\n|Franklin Resources|860|0.013%|\n|National Pension Service|172,845|3.345%|\n|Mitsubishi Ufj Asset Management|578,266|12.34%|\n|Rhumbline Advisers|20,295|0.39%|\n|Dimensional Fund Advisors|119,500|2.577%|\n|Wells Fargo|1,176,846|35.262%|\n|Aberdeen Group|1,729,053|65.228%|\n\n*\\*JPM analyst has one of the lowest price targets on Tesla and Canada was supposed to be \"mad\" at America. Ha! Not so much obviously...*\n\n**Sellers (shares/% decrease in overall position):**\n\n|Institution|Shares Sold|Percent Decrease In Position|\n|:-|:-|:-|\n|Capital World Investors|(954,950)|\\-2.317%|\n|Fmr LLC|(4,448,041)|\\-12.883%|\n|Northern Trust Corp|(992,003)|\\-3.471%|\n|Bank Of New York Mellon|(418,764)|\\-2.46%|\n|Wellington Management Group|(1,285,882)|\\-12.639%|\n|Jennison Associates|(994,502)|\\-10.239%|\n|Capital Research Global Investors|(755,524)|\\-9.637%|\n|Primecap Management|(473,525)|\\-6.267%|\n|American Century Companies|(157,691)|\\-2.183%|\n|Bank Of Montreal|(50,142)|\\-0.729%|\n|Ubs Group Ag|(757,244)|\\-10.429%|\n|California Public Employees Retirement System\\*|(60,314)|\\-1.265%|\n|Principal Financial Group Inc|(165,095)|\\-4.362%|\n|New York State Common Retirement Fund\\*|(112,326)|\\-3.195%|\n|Ark Investment Management|(28,594)|\\-0.87%|\n\n*\\*I assume these sales are politically motivated to some extent.*\n\nAgain, trying to be objective here, it clearly looks like moves to the upside are being made by more prominent name firms and in more dramatic fashion. There are two firms with over a billion in holdings that added triple digit percent increases and Nuveen, that made a massive move to rush in. Of course, I could go down the huge list of transactions and cherry pick things to paint the picture either way. Are there firms with hundreds of millions in holdings cutting their position by \\~50%? Yes. But there are actually more making the opposite/optimistic move (as the overall numbers at the beginning of this post indicate).\n\nMy takeaway: The big boys are making huge moves on Tesla. There is a lot of institutional activity in general, with astonishing sums of money being injected into the stock by big name firms. Net flows in are larger than net flows out. Don't shoot the messenger- But the indicator is bullish. And the recent stock trend reflects it.", "score": 15, "comments": 18}
{"id": "1kmjx3u", "title": "Google needs 'big bang breakup' that would value its businesses at $3.7 trillion as AI threatens Search", "author": "ironcladjogging", "created_utc": 1747240902.0, "selftext": "Goog is one of my largest positions. I'm bullish on the company and thinking about going all in.\n\nThe stock has been punished for fears it seems to be:\n\n1. Out of the AI race (it's not, Gemini is fantastic)\n2. Search is dead (it's not but it probably will be given enough time. However, it could easily be like tobacco companies that have great margins and exist for decades as solid businesses without growth due to personal habits)\n3. Will be broken up\n\nThis last point is fascinating to me because as I understand it, if it were to be broken up, shareholders would receive shares in all of the constituent parts. \n\nMeaning, I would get a shares in GCP, YouTube, Search, Waymo, etc. I would LOVE to have shares in any of those businesses individually. \n\nThe article below values all of Google's businesses at a staggering $3.7 trillion.\n\n[https://finance.yahoo.com/news/google-needs-big-bang-breakup-that-would-value-its-businesses-at-37-trillion-as-ai-threatens-search-analyst-171143842.html?guce\\_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce\\_referrer\\_sig=AQAAADxZpheK3u8TveRxgpzmaZCVXvQ7wAOPpW-pIlY8Xa6bYSOX99OVwn9LAuPPLqTzyKGtgE7I74IzSfrlQUAWHvaU53JttuhwRj4hUNZpWhflmHfDyjLhHxhX7YXdK\\_b68waPP1g545TNU2lkXrZJWlAiysD8Px6AqA6xPVXqThK7&guccounter=2](https://finance.yahoo.com/news/google-needs-big-bang-breakup-that-would-value-its-businesses-at-37-trillion-as-ai-threatens-search-analyst-171143842.html?guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAADxZpheK3u8TveRxgpzmaZCVXvQ7wAOPpW-pIlY8Xa6bYSOX99OVwn9LAuPPLqTzyKGtgE7I74IzSfrlQUAWHvaU53JttuhwRj4hUNZpWhflmHfDyjLhHxhX7YXdK_b68waPP1g545TNU2lkXrZJWlAiysD8Px6AqA6xPVXqThK7&guccounter=2)", "score": 447, "comments": 129}
{"id": "1kmiq62", "title": "$UNH is way oversold", "author": "Euro347", "created_utc": 1747238095.0, "selftext": "Top 5 Reasons its a buy\n\n\\#1 -  UNH is ranked #7 globally for companies by revenue. Revenue was $400B last year\n\n\\#2 - Revenues keeps growing YoY and you get a decent dividend\n\n\\#3 - Lower prescription prices coming will increase profitability. Good for insurance having to pay less, not good for pharma companies.\n\n\\#4 - Health insurance is a necessity, globally\n\n\\#5 -  The AI factor, we see more breakthroughs in healthcare and medicine, less sick people means less insurance payouts but people still need insurance just in case.\n\nI think we bounce to $400 by july 4th\n\nReally hoping Buffett takes a position at this  super low PE", "score": 132, "comments": 420}
{"id": "1kmij7n", "title": "What's the deal with sellers?", "author": "trading335i", "created_utc": 1747237629.0, "selftext": "I have been trading for about 5 years. Self taught lost a lot, gained a lot of knowledge from those losses. I stay away from options. \nI have my own strategy and have been fortunate enough to be able to do it full time.\n\nI watch live trades on ADVFN, and I don't understand why when I'm watching a stock with high volume, usually get a constant barrage of sellers offloading when there is clear demand from buyers.\n\nFor example - Shares might be up 3% Premarket, but then there's a sell-off on open and it's down 3% after 5mins. Buyers will be all over it, buying up, and clearly there's demand as it tries to push back up, and would easily climb back to the + 3% it was at pre-market. \nBut even with the demand, sellers seem to keep dumping more in to sell, which just creates a barrier and slows the gains down and it frustrates me 🤣🤦\n\nWhy does this happen? \n\nI can't imagine it being peoples rules triggering (stop loss, take profit etc.), as that would have happened on open and maybe pushed it down the 3% on open. But this happens as it's climbing back up, so there's more buyers than sellers.\n\nIs it bots that are auto trading? or people selling that can't the see the demand volume in live trades?\n\nI just don't understand why the need to sell is, when you could not sell, and watch it climb at least back into the green since demand is there, and sell at a profit.", "score": 0, "comments": 8}
{"id": "1kmi1ki", "title": "Anyone invested in SOXL stocks?", "author": "Choice-Definition794", "created_utc": 1747236430.0, "selftext": "Been told by a family in mid April when the SOXL stock was around $7.00 and now it reached 18.70, Anyone knows if I should keep it or pull my money out? From the looks of it, It’s been going well but i’m not an expert. Thank you in advance!  ", "score": 2, "comments": 15}
{"id": "1kmhbrh", "title": "Court hearings on tariffs the reason the market has bounced back?", "author": "Plane_Employment_930", "created_utc": 1747234719.0, "selftext": "I had no idea there was a legitimate possibility that the courts would deem the tariffs illegal. This is potentially HUGE news but I'm not seeing much talk about it, am I missing something, is this not a threat to the the tariffs in place? And is this maybe why the market doesn't seem concerned about the 10% global tariffs that are still in place?  \n[https://www.vox.com/economy/412966/supreme-court-tariffs-donald-trump-trade-vos-selections](https://www.vox.com/economy/412966/supreme-court-tariffs-donald-trump-trade-vos-selections)", "score": 189, "comments": 69}
{"id": "1kmgcs8", "title": "Is Apple Stock Not Worth it Anymore?!!!", "author": "Fearless-Cellist-245", "created_utc": 1747232343.0, "selftext": "Their vision pro goggles were a big waste of money and they were doing R&D for an EV for 10 years which ended up failing. It looks like their strongest assets are still their phones. I don't think they are innovating enough and its possible they could be the next IBM. MOST notably, they got rear ended by the recent AI boom and haven't been able to catchup. Microsoft, Google, and many other tech giants are innovating towards AI at an alarmingly fast rate, except Apple. Is this stock still worth it, or is it the next IBM?", "score": 0, "comments": 21}
{"id": "1kmfz96", "title": "Is SCHD the way in this current market?", "author": "Dukkhalife", "created_utc": 1747231407.0, "selftext": "What are the odds the market goes to new highs in the next 6-8 months?  To me its almost none.  Its kinda crazy that we got here, but going to new heights with what lies ahead for atleast 8 months, its gonna raise and dip for a while.\n\nSCHD at the moment looks almost like a 4% bond, that is about 5-8% undervalued at the moment, in a market that looks like its going to coast for a while.\n\nAlso and this I'm not certain on, but all retirement funds that had to pull out recently due to crazy uncertainty may jump back into funds like schd, providing some natural upliftment....\n\n", "score": 0, "comments": 53}
{"id": "1kmfy24", "title": "IPO Timing/ETOR", "author": "Upset_Letter275", "created_utc": 1747231320.0, "selftext": "Hi All\n\nSomewhat new investor, but I’ve never really  engaged with IPOs and I am confused.  \n\nI decided I would take a cautious shot at Etoro (ETOR) which, according to the news, would debut today.  I see I am able to bid on the projected price…but the stock doesn’t appear to be trading.  When does the stock buy and sell as a normal stock?  It’s listed on NASDAQ Global Select.  Any help will be greatly appreciated. Thanks.", "score": 0, "comments": 3}
